zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
#include "S32K144_API.h"
#include "system_S32K144.h"             // Keil::Device:Startup
#include "clock_S32K1xx.h"              // Keil::Device:SDK Driver:Clock
#include "clock_manager.h"              // Keil::Device:SDK Driver:Clock
#include "string.h"
//#include "S32K144.h"
#include "function.h"
#include "s32_core_cm4.h"
/*===========================================================特殊常量定义区===========================================================*/
#if	RESET_VECTOR_HANDLE == 1		/*手动强制定位复位向量地址*/
extern	void Reset_Handler(void);
const	unsigned int	PushPollPointer __attribute__((at(0x0000))) = 0X20007000;					/*定义上电初始化堆栈指针*/
const	unsigned int	ResetVectorPROC __attribute__((at(0x0004))) =(unsigned int)Reset_Handler;		/*定义上电初始化首地址*/
#endif
/*===============================================================全局变量定义区=======================================================*/
struct CAN_MESSAGE_BUFFER   Can0TranBuffer[CAN0_TRAN_BUFF_SIZE];              /*CAN0发送缓冲去*/
struct CAN_MESSAGE_BUFFER   Can1TranBuffer[CAN1_TRAN_BUFF_SIZE];              /*CAN1发送缓冲去*/
struct CAN_MESSAGE_BUFFER   Can2TranBuffer[CAN2_TRAN_BUFF_SIZE];              /*CAN2发送缓冲去*/
struct CAN_MESSAGE_BUFFER   Can0ReceBuffer[CAN0_RECE_BUFF_SIZE];              /*CAN0接收缓冲区*/
struct CAN_MESSAGE_BUFFER   Can1ReceBuffer[CAN1_RECE_BUFF_SIZE];              /*CAN1接收缓冲区*/
struct CAN_MESSAGE_BUFFER   Can2ReceBuffer[CAN2_RECE_BUFF_SIZE];              /*CAN2接收缓冲区*/
int   Can0TranTop,Can0TranTail;                                               /*CAN0发送缓冲区头尾指针*/
int   Can1TranTop,Can1TranTail;                                               /*CAN1发送缓冲区头尾指针*/
int   Can2TranTop,Can2TranTail;                                               /*CAN2发送缓冲区头尾指针*/
int   Can0RecePosition,Can1RecePosition,Can2RecePosition;                     /*Can0、Can1、Can2接收缓冲区指针位置*/
unsigned int	HostCommandState;								/*主机发送命令状态*/
unsigned int	SystemTicksPrev;								/*系统时间节拍缓冲*/
unsigned	char	HostData[8];								/*上位机发送给数据*/	
unsigned	char	CcpDataBuff[8];								/*CCP标定数据缓冲区*/
unsigned	int	Atd0Pos;									/*当前A/D转换通道号*/
unsigned	int	UbVoltageValue,Ad2428Vout2Value,AD2428PowerValue;		/*三路电压监控A/D转换值*/
int	UbVoltageBuff,Ad2428Vout2Buff,Ad2428PowerBuff;					/*A/D转换滤波缓冲区*/
unsigned	int	UbVoltage;									/*UB电压值，精度0.01V*/
unsigned	int	Ad2428Vout2;								/*AD2428输出电压Vout2电压值，精度0.01V*/
unsigned	int	Ad2428Power;								/*AD2428供电电压值，精度0.01V*/
/*----------------------------------------------------------------------------
  configure SystemCoreClock:
     System Clock source         PLL (OSC)
     OSC Frequency(Hz)           8000000
     SYSCLK(Hz)                  80000000
     PLLMUL                      20
     PREDIV                      2
 *----------------------------------------------------------------------------*/
void SystemCoreClockConfigure(void) 
{

	SCG->SOSCCSR = SCG_SOSCCSR_SOSCERR(1U);		/*系统时钟监控使能(外部晶体振荡器)*/

	/* set up OSC clock. */
	/* Setup dividers. */
	SCG->SOSCDIV = (SCG_SOSCDIV_SOSCDIV1(1U) |
                  SCG_SOSCDIV_SOSCDIV2(1U)  );	/*系统OSC时钟倍除因子*/

	/* Set OSC configuration. */
	SCG->SOSCCFG = (SCG_SOSCCFG_EREFS(1U) |
                  SCG_SOSCCFG_RANGE(2U)  );	/*使用石英晶体振荡器、频率为中等速度*/

	/* Enable clock. */
	SCG->SOSCCSR = (SCG_SOSCCSR_SOSCEN(1U) );	/*使能系统石英振荡器*/

	/* Wait for OSC clock to be valid. */
	while (!(SCG->SOSCCSR & SCG_SOSCCSR_SOSCVLD(1U))) __NOP();	/*等待检测石英振荡器工作稳定*/

	/* Init SIRC */
	SCG->SIRCCSR = 0U;	/*所有Slow IRC相关功能关闭*/

	/* Setup dividers. */
	SCG->SIRCDIV = (SCG_SIRCDIV_SIRCDIV1(1U) |
                  SCG_SIRCDIV_SIRCDIV2(2U)  );	/*Slow IRC倍除因子*/

	/* Set SIRC configuration. */
	SCG->SIRCCFG = SCG_SIRCCFG_RANGE(1U);	/*设置Slow IRC频率为8MHz*/

	/* Enable clock. */
	SCG->SIRCCSR = SCG_SIRCCSR_SIRCEN(1U);	/*使能Slow IRC时钟*/

	/* Wait for SIRC clock to be valid. */
	while (!(SCG->SIRCCSR & SCG_SIRCCSR_SIRCVLD(1U))) __NOP();	/*等待Slow IRC工作稳定*/

	/* Change to SIRC as system clock source */
	SCG->RCCR = (SCG_RCCR_DIVSLOW(3U) |
               SCG_RCCR_DIVBUS(0U)  |
               SCG_RCCR_DIVCORE(0U) |
               SCG_RCCR_SCS(2U)     );	/*设置系统时钟为Slow IRC、总线时钟倍除因子为1、核时钟倍除因子为1、Slow Clock倍除因子为3*/

	/* Wait for clock source switch finished. */
	while ((SCG->RCCR & 0x0F000000) != 0x02000000) __NOP();;	/*等待时钟切换完成*/

	/* Init Firc */
	SCG->FIRCCSR = 0U;	/*所有Fast IRC相关功能关闭*/

	/* Setup dividers. */
	SCG->FIRCDIV = (SCG_FIRCDIV_FIRCDIV1(1U) |
                  SCG_FIRCDIV_FIRCDIV2(1U)  );	/*Fast IRC倍除因子*/

	/* Set FIRC configuration. */
	SCG->FIRCCFG = SCG_FIRCCFG_RANGE(0U);	/*设置Fast IRC频率为48MHz*/

	/* Enable clock. */
	SCG->FIRCCSR |= SCG_FIRCCSR_FIRCEN(1U);	/*使能Fast IRC*/

	/* Wait for FIRC clock to be valid. */
	while (!(SCG->FIRCCSR & SCG_FIRCCSR_FIRCVLD(1U))) __NOP();;	/*等待Fast IRC工作稳定*/

	/* Init SysPll */
	SCG->SPLLCSR = SCG_SPLLCSR_SPLLERR(1U);		/*系统锁相环监控使能*/

	/* Setup dividers. */
	SCG->SPLLDIV = (SCG_SPLLDIV_SPLLDIV1(1U) |
                  SCG_SPLLDIV_SPLLDIV2(2U)  );	/*设置锁相环倍除因子*/

	/* Set PLL configuration. */
	SCG->SPLLCFG = (SCG_SPLLCFG_PREDIV(0U) |                     /* prediv 1 */
                  SCG_SPLLCFG_MULT(4U)   );                    /* pll multiply 20 */

	/* Enable clock. */
	SCG->SPLLCSR = SCG_SPLLCSR_SPLLEN(1U);	/*使能锁相环时钟*/

	/* Wait for PLL clock to be valid. */
	while (!(SCG->SPLLCSR & SCG_SPLLCSR_SPLLVLD(1U))) __NOP();	/*等待锁相环时钟工作稳定*/

	/* Change to use PLL as system clock source */
	SCG->RCCR = (SCG_RCCR_DIVSLOW(2U) |
               SCG_RCCR_DIVBUS(1U)  |
               SCG_RCCR_DIVCORE(0U) |
               SCG_RCCR_SCS(6U)     );	/*系统使用锁相环输出时钟、总线倍除因子为2、核倍除因子为1、Slow Clock倍除因子为3*/

	/* Wait for clock source switch finished. */
	while ((SCG->RCCR & 0x0F000000) != 0x06000000) __NOP();	/*等待时钟切换稳定*/
}
/*=================================================初始化系统硬件====================================================*/
void	InitHardware(void)
{
	/*=================================使能所有外设时钟============================================*/
	PCC->PCCn[PCC_PORTA_INDEX]=PCC_PCCn_CGC(1);	/*端口A时钟使能*/
	PCC->PCCn[PCC_PORTB_INDEX]=PCC_PCCn_CGC(1);	/*端口B时钟使能*/
	PCC->PCCn[PCC_PORTC_INDEX]=PCC_PCCn_CGC(1);	/*端口C时钟使能*/
	PCC->PCCn[PCC_PORTD_INDEX]=PCC_PCCn_CGC(1);	/*端口D时钟使能*/
	PCC->PCCn[PCC_PORTE_INDEX]=PCC_PCCn_CGC(1);	/*端口E时钟使能*/
//      SIM->PLATCGC=SIM->PLATCGC | SIM_PLATCGC_CGCDMA(1);             /*DMA通道时钟默认为启动*/
      PCC->PCCn[PCC_DMAMUX_INDEX] = PCC_PCCn_CGC(1);  /*使能DMAMUX时钟*/
      PCC->PCCn[PCC_FTFC_INDEX]=PCC_PCCn_CGC(1);	/*FTFC-FLASH时钟使能*/
	
