zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
	/*=============================设置端口功能====================================================*/
	PORTA->PCR[5]=PORT_PCR_MUX(7);			/*PTA5为复位输入口*/
	PORTA->PCR[17]=PORT_PCR_MUX(1);			/*PTA17为一般I/O口输出*/
	PORTA->PCR[16]=PORT_PCR_MUX(1);			/*PTA16为一般I/O口输出*/
	PORTA->PCR[15]=PORT_PCR_MUX(1);			/*PTA15为一般I/O口输出*/
	PORTA->PCR[14]=PORT_PCR_MUX(1);			/*PTA14为一般I/O口输出*/
	PORTA->PCR[13]=PORT_PCR_MUX(1);			/*PTA13为一般I/O口输出*/
	PORTA->PCR[12]=PORT_PCR_MUX(1);			/*PTA12为一般I/O口输出*/
	PORTA->PCR[11]=PORT_PCR_MUX(1);			/*PTA11为一般I/O口输出*/
	PORTA->PCR[3]=PORT_PCR_MUX(1);			/*PTA3为一般I/O口输出*/
	PORTA->PCR[2]=PORT_PCR_MUX(1);			/*PTA2为一般I/O口输出*/
	
	PORTB->PCR[17]=PORT_PCR_MUX(1);			/*PTB17为一般I/O口输出*/
	PORTB->PCR[16]=PORT_PCR_MUX(1);			/*PTB16为一般I/O口输出*/
	PORTB->PCR[15]=PORT_PCR_MUX(1);			/*PTB15为一般I/O口输出*/
	PORTB->PCR[14]=PORT_PCR_MUX(1);			/*PTB14为一般I/O口输出*/
	PORTB->PCR[13]=PORT_PCR_MUX(1);			/*PTB13为一般I/O口输出*/
	PORTB->PCR[12]=PORT_PCR_MUX(1);			/*PTB12为一般I/O口输出*/
	PORTB->PCR[11]=PORT_PCR_MUX(1);			/*PTB11为一般I/O口输出*/
	PORTB->PCR[8]=PORT_PCR_MUX(1);			/*PTB8为一般I/O口输出*/
	PORTB->PCR[5]=PORT_PCR_MUX(2);			/*PTB5为FTM0_CH5输出*/
	PORTB->PCR[4]=PORT_PCR_MUX(2);			/*PTB4为FTM0_CH4输出*/
	PORTB->PCR[3]=PORT_PCR_MUX(2);			/*PTB3为FTM1_CH1输出*/
	PORTB->PCR[2]=PORT_PCR_MUX(2);			/*PTB2为FTM1_CH0输出*/
	PORTB->PCR[1]=PORT_PCR_MUX(1);			/*PTB1为一般I/O口输出*/
	PORTB->PCR[0]=PORT_PCR_MUX(1);			/*PTB0为一般I/O口输出*/
	
	PORTC->PCR[17]=PORT_PCR_MUX(1);			/*PTC17为一般I/O口输出*/
	PORTC->PCR[16]=PORT_PCR_MUX(1);			/*PTC16为一般I/O口输出*/
	PORTC->PCR[15]=PORT_PCR_MUX(2);			/*PTC15FTM1_CH3输出*/
	PORTC->PCR[14]=PORT_PCR_MUX(2);			/*PTC14FTM1_CH2输出*/
	PORTC->PCR[10]=PORT_PCR_MUX(1);			/*PTC10为一般I/O口输出*/
	PORTC->PCR[9]=PORT_PCR_MUX(1);			/*PTC9为一般I/O口输出*/
	PORTC->PCR[8]=PORT_PCR_MUX(1);			/*PTC8为一般I/O口输出*/
	PORTC->PCR[3]=PORT_PCR_MUX(2);			/*PTC3为FTM0_CH3输出*/
	PORTC->PCR[2]=PORT_PCR_MUX(2);			/*PTC2为FTM0_CH2输出*/
	PORTC->PCR[1]=PORT_PCR_MUX(6);			/*PTC1为FTM1_CH7输出*/
	PORTC->PCR[0]=PORT_PCR_MUX(6);			/*PTC0为FTM1_CH6输出*/
	
	PORTD->PCR[17]=PORT_PCR_MUX(1);			/*PTD17为一般I/O口输出*/
	PORTD->PCR[16]=PORT_PCR_MUX(2);			/*PTD16为FTM0_CH1输出*/
	PORTD->PCR[15]=PORT_PCR_MUX(2);			/*PTD15为FTM0_CH0输出*/
	PORTD->PCR[14]=PORT_PCR_MUX(1);			/*PTD14为一般I/O口输出*/
	PORTD->PCR[13]=PORT_PCR_MUX(1);			/*PTD13为一般I/O口输出*/
	PORTD->PCR[12]=PORT_PCR_MUX(1);			/*PTD12为一般I/O口输出*/
	PORTD->PCR[11]=PORT_PCR_MUX(1);			/*PTD11为一般I/O口输出*/
	PORTD->PCR[10]=PORT_PCR_MUX(1);			/*PTD10为一般I/O口输出*/
	PORTD->PCR[9]=PORT_PCR_MUX(6);			/*PTD9为FTM1_CH5输出*/
	PORTD->PCR[8]=PORT_PCR_MUX(6);			/*PTD8为FTM1_CH4输出*/
	PORTD->PCR[7]=PORT_PCR_MUX(1);			/*PTD7为一般I/O口输出*/
	PORTD->PCR[6]=PORT_PCR_MUX(1);			/*PTD6为一般I/O口输出*/
	PORTD->PCR[5]=PORT_PCR_MUX(1);			/*PTD5为一般I/O口输出*/
	PORTD->PCR[4]=PORT_PCR_MUX(1);			/*PTD4为一般I/O口输出*/
	PORTD->PCR[3]=PORT_PCR_MUX(1);			/*PTD3为一般I/O口输出*/
	PORTD->PCR[2]=PORT_PCR_MUX(1);			/*PTD2为一般I/O口输出*/
	PORTD->PCR[1]=PORT_PCR_MUX(1);			/*PTD1为一般I/O口输出*/
	PORTD->PCR[0]=PORT_PCR_MUX(1);			/*PTD0为一般I/O口输出*/
//	PORTD->PCR[1]=PORT_PCR_MUX(6);			/*PTD1为FXIO_D1输出*/
//	PORTD->PCR[0]=PORT_PCR_MUX(6);			/*PTD0为FXIO_D0输出*/
	
	PORTE->PCR[16]=PORT_PCR_MUX(6);			/*PTE16为FXIO_D3输出*/
	PORTE->PCR[15]=PORT_PCR_MUX(6);			/*PTE15为FXIO_D2输出*/
	PORTE->PCR[14]=PORT_PCR_MUX(1);			/*PTE14为一般I/O口输出*/
	PORTE->PCR[11]=PORT_PCR_MUX(6);			/*PTE11为FXIO_D5输出*/
	PORTE->PCR[10]=PORT_PCR_MUX(6);			/*PTE10为FXIO_D4输出*/
	PORTE->PCR[9]=PORT_PCR_MUX(2);			/*PTE9为FXIO_D7输出*/
	PORTE->PCR[8]=PORT_PCR_MUX(2);			/*PTE8为FXIO_D6输出*/
	PORTE->PCR[6]=PORT_PCR_MUX(1);			/*PTE6为一般I/O口输出*/
	PORTE->PCR[2]=PORT_PCR_MUX(1);			/*PTE2为一般I/O口输出*/
	PORTE->PCR[1]=PORT_PCR_MUX(1);			/*PTE1为一般I/O口输出*/
	PORTE->PCR[0]=PORT_PCR_MUX(1);			/*PTE0为一般I/O口输出*/
	/*==========================IIC总线端口配置========================================*/
//	PORTA->PCR[2]=PORT_PCR_MUX(3);			/*PTA2为IIC_SDA输出*/
//	PORTA->PCR[3]=PORT_PCR_MUX(3);			/*PTA3为IIC_SCL输出*/
	/*==========================CAN总线端口配置========================================*/
	PORTE->PCR[4]=PORT_PCR_MUX(5);			/*设置PTD4为CAN0_RX通讯口*/
	PORTE->PCR[5]=PORT_PCR_MUX(5);			/*设置PTD5为CAN0_TX通讯口*/
	
//	PORTA->PCR[12]=PORT_PCR_MUX(3);			/*设置PTA12为CAN1_RX通讯口*/
//	PORTA->PCR[13]=PORT_PCR_MUX(3);			/*设置PTA13为CAN1_TX通讯口*/
	
//	PORTC->PCR[16]=PORT_PCR_MUX(3);			/*设置PTC16位CAN2_RX通讯口*/
//	PORTC->PCR[17]=PORT_PCR_MUX(3);			/*设置PTC17位CAN2_TX通讯口*/
      /*==========================LPSPI端口配置==========================================*/
//      PORTB->PCR[4]=PORT_PCR_MUX(3);                  /*LPSPI模块SPI0通道(SOUT)*/
//      PORTB->PCR[5]=PORT_PCR_MUX(4);                  /*LPSPI模块SPI0通道(PCS0)*/
//      PORTD->PCR[15]=PORT_PCR_MUX(4);                 /*LPSPI模块SPI0通道(SCK)*/
//      PORTD->PCR[16]=PORT_PCR_MUX(4);                 /*LPSPI模块SPI0通道(SIN)*/
      
//      PORTD->PCR[1]=PORT_PCR_MUX(3);                  /*LPSPI模块SPI1通道(SIN)*/
//      PORTD->PCR[0]=PORT_PCR_MUX(3);                  /*LPSPI模块SPI1通道(PCS0)*/
//      PORTE->PCR[1]=PORT_PCR_MUX(5);                  /*LPSPI模块SPI1通道(SCK)*/
//      PORTB->PCR[16]=PORT_PCR_MUX(3);                 /*LPSPI模块SPI1通道(SOUT)*/

//      PORTE->PCR[11]=PORT_PCR_MUX(2);                 /*LPSPI模块SPI2通道(PCS0)*/
//      PORTE->PCR[15]=PORT_PCR_MUX(3);                 /*LPSPI模块SPI2通道(SCK)*/
//      PORTE->PCR[16]=PORT_PCR_MUX(3);                 /*LPSPI模块SPI2通道(SIN)*/
//      PORTA->PCR[8]=PORT_PCR_MUX(3);                  /*LPSPI模块SPI2通道(SOUT)*/
//      PORTE->PCR[10]=PORT_PCR_MUX(3);                 /*LPSPI模块SPI2通道(PCS1)*/
      /*============================A/D转换模块端口配置====================================*/
      PORTA->PCR[0]=PORT_PCR_MUX(0);                  /*ADC0_SE0*/
      PORTA->PCR[1]=PORT_PCR_MUX(0);                  /*ADC0_SE1*/
      PORTA->PCR[6]=PORT_PCR_MUX(0);                  /*ADC0_SE2*/
//      PORTA->PCR[7]=PORT_PCR_MUX(0);                  /*ADC0_SE3*/
//      PORTB->PCR[0]=PORT_PCR_MUX(0);                  /*ADC0_SE4*/
//      PORTB->PCR[1]=PORT_PCR_MUX(0);                  /*ADC0_SE5*/
//      PORTB->PCR[2]=PORT_PCR_MUX(0);                  /*ADC0_SE6*/
//      PORTB->PCR[3]=PORT_PCR_MUX(0);                  /*ADC0_SE7*/
//      PORTC->PCR[0]=PORT_PCR_MUX(0);                  /*ADC0_SE8*/
//      PORTC->PCR[1]=PORT_PCR_MUX(0);                  /*ADC0_SE9*/
//      PORTC->PCR[2]=PORT_PCR_MUX(0);                  /*ADC0_SE10*/
//      PORTC->PCR[3]=PORT_PCR_MUX(0);                  /*ADC0_SE11*/
//      PORTD->PCR[2]=PORT_PCR_MUX(0);                  /*ADC1_SE2*/
//      PORTD->PCR[3]=PORT_PCR_MUX(0);                  /*ADC1_SE3*/
//      PORTD->PCR[4]=PORT_PCR_MUX(0);                  /*ADC1_SE4*/
//      PORTC->PCR[6]=PORT_PCR_MUX(0);                  /*ADC1_SE5*/
//      PORTC->PCR[7]=PORT_PCR_MUX(0);                  /*ADC1_SE6*/
//      PORTB->PCR[12]=PORT_PCR_MUX(0);                 /*ADC1_SE7*/
//      PORTB->PCR[13]=PORT_PCR_MUX(0);                 /*ADC1_SE8*/
//      PORTB->PCR[14]=PORT_PCR_MUX(0);                 /*ADC1_SE9*/
//      PORTE->PCR[2]=PORT_PCR_MUX(0);                  /*ADC1_SE10*/
//      PORTE->PCR[6]=PORT_PCR_MUX(0);                  /*ADC1_SE11*/
//      PORTA->PCR[15]=PORT_PCR_MUX(0);                 /*ADC1_SE12*/
//      PORTA->PCR[16]=PORT_PCR_MUX(0);                 /*ADC1_SE13*/
      /*=================================输入捕捉端口设置======================================*/
//      PORTD->PCR[10]=PORT_PCR_MUX(2);                  /*FTM2_CH0输入捕捉端口*/
	/*==================================端口方向设定===========================================*/
	PTA->PDDR=0X3F80C;					/*PTA17、16、15、14、13、12、11、3、2为输出口*/
	PTB->PDDR=0X003F;						/*PTB0、1、2、3、4、5为输出端口*/
	PTC->PDDR=0XC70F;						/*PTC10、9、8、14、15、0、1、2、3为输出端口*/
	PTD->PDDR=0X3FF7F;					/*PTD17—PTD8，PTD6—PTD0为输出口*/
	PTE->PDDR=0X4347;						/*PTE0、1、2、6、8、9、14为输出口*/
      
	DISABLE_SCL_CLEAR;					/*PTA3=0*/
	DISABLE_SDA_CLEAR;					/*PTA2=0*/
	DISABLE_PTD_PD0;						/*PTD0=0*/
	DISABLE_PTD_PD1;						/*PTD1=0*/
	
	POWER_LOCK_ENABLE;					/*设置使能电源自锁,PTC10=1*/

      /*================================InitATD初始化A/D转换===================================*/
	Atd0Pos=UB_VOLTAGE_CHANNEL;		/*当前A/D转换通道号:系统供电UB电压A/D转换通道*/
	UbVoltageValue=0;				/*UB电压AD转换值*/
	Ad2428Vout2Value=0;			/*AD2428输出电压Vout的A/D转换值*/
	AD2428PowerValue=0;			/*AD2428供电电压A/D转换值*/
	UbVoltageBuff=0;				/*A/D转换滤波缓冲区*/
	Ad2428Vout2Buff=0;			/*A/D转换滤波缓冲区*/
	Ad2428PowerBuff=0;			/*A/D转换滤波缓冲区*/
      InitATD();
      AutoCalibrationATD();                           /*ADC自动校正*/    
      WATCHDOG_TRIGGER;       /*触发看门狗喂食,PTC9翻转*/ 
      /*===============================初始化PWM特征捕捉功能=====================================*/
	FTM0_init();				/*初始化FTM0模块*/	
	FTM1_init();				/*初始化FTM1模块*/	
//      InitFtm2Capture();                                             
      /*===================================初始化DMA模块=======================================*/
      DmaInitial();
	/*==================================初始换CAN总线模块=====================================*/
	CAN_EN_ENABLE;			/*使能CAN_EN,PTE1=1*/
	CAN_STB_ENABLE;			/*使能CAN_STB,PTE0=1*/	
	InitCan(CanChannel0,CAN_500);				/*CAN0初始化，速率500Khz，CAN0为整车CAN通道*/
      /*===================================初始化LPSpi模块======================================*/
//      InitLPSpi(SpiChannel0,1);                       /*初始化QSPI0模块，使能DMA传输*/
//      InitLPSpi(SpiChannel1,1);                       /*初始化QSPI1模块，使能DMA传输*/
//      InitLPSpi(SpiChannel2,0);                       /*初始化QSPI2模块，禁止DMA传输*/
      /*======================================FLEXRAM分区命令====================================*/
      WATCHDOG_TRIGGER;       /*触发看门狗喂食,PTC9翻转*/ 
      FlexRamParden();                                        
      /*=================================设置FLEXRAM为EEPROM仿真模式=============================*/
      WATCHDOG_TRIGGER;       /*触发看门狗喂食,PTC9翻转*/ 
      FlexramEeprom();              
      /*====================================中断向量重新定位====================================*/
      S32_SCB->VTOR=0X8000;                           /*中断向量表重新定位到0X8000处,底端FLASH留给Bootloader用*/
}
/*============================================使能CAN总线时钟====================================
	返回值:NULL
	参数:Channel是一个枚举变量，表示CAN总线的通道号
================================================================================================*/	
void 	EnableCanClock(CANCHANNEL Channel)
{
	switch(Channel)
	{
		case	CanChannel0:
			PCC->PCCn[PCC_FlexCAN0_INDEX]=PCC_PCCn_CGC(1);	/*使能CAN0时钟源*/
		break;
		case	CanChannel1:
			PCC->PCCn[PCC_FlexCAN1_INDEX]=PCC_PCCn_CGC(1);	/*使能CAN1时钟源*/
		break;
		case	CanChannel2:
			PCC->PCCn[PCC_FlexCAN2_INDEX]=PCC_PCCn_CGC(1);	/*使能CAN2时钟源*/
		break;
	};
};
/*=====================================使CAN模块进入复位状态=====================================
	返回值:NULL
	参数:Channel是一个枚举变量，表示CAN总线的通道号
================================================================================================*/
void 	ResetCanModule(CANCHANNEL Channel)
{
	switch(Channel)
	{
		case	CanChannel0:
			CAN0->MCR=CAN0->MCR | CAN_MCR_SOFTRST(1);		/*CAN0进入CAN总线复位模式*/
			while(CAN0->MCR & CAN_MCR_SOFTRST(1)) {};		/*等待CAN总线复位完成*/
		break;
		case	CanChannel1:
			CAN1->MCR=CAN1->MCR | CAN_MCR_SOFTRST(1);		/*CAN0进入CAN总线复位模式*/
			while(CAN1->MCR & CAN_MCR_SOFTRST(1)) {};		/*等待CAN总线复位完成*/
		break;
		case	CanChannel2:
			CAN2->MCR=CAN2->MCR | CAN_MCR_SOFTRST(1);		/*CAN0进入CAN总线复位模式*/
			while(CAN2->MCR & CAN_MCR_SOFTRST(1)) {};		/*等待CAN总线复位完成*/
		break;
	};
};
/*=====================================================初始化CAN总线==========================================
	返回值：无
	参  数：
		Channel：CAN模块号，这是一个CANCHANNEL变量，表示CAN的三个模块{CanChannel0 ,CanChannel1 ,CanChannel2}
		baud：CAN通讯速率，这是一个CANBAUD变量，{CAN_1000,CAN_500,CAN_250,CAN_200,CAN_125,CAN_100,CAN_50}
=============================================================================================================*/
void 	InitCan(CANCHANNEL Channel,CANBAUD baud)				/*CAN0初始化函数*/
{
CAN_Type *CanPoint;
unsigned char	PreDivide;		/*时钟预分频数*/	
unsigned char	ReceMnSize;		/*邮箱位置,接收邮箱数量,发送邮箱位置*/
unsigned char	TranMnPos;	
unsigned char	MnPos;
	switch(Channel)
	{
		case	CanChannel0:
			CanPoint=(CAN_Type *)CAN0_BASE;			/*设置相应的CAN指针首地址*/
			ReceMnSize=CAN0_RECE_MN_SIZE;				/*CAN0接收数据邮箱长度*/
			TranMnPos=CAN0_TRAN_MN_POS;				/*CAN0发送数据邮箱位置*/
		break;
		case	CanChannel1:
			CanPoint=(CAN_Type *)CAN1_BASE;			/*设置相应的CAN指针首地址*/
			ReceMnSize=CAN1_RECE_MN_SIZE;				/*CAN1接收数据邮箱长度*/
			TranMnPos=CAN1_TRAN_MN_POS;				/*CAN1发送数据邮箱位置*/
		break;
		case	CanChannel2:
			CanPoint=(CAN_Type *)CAN2_BASE;			/*设置相应的CAN指针首地址*/
			ReceMnSize=CAN2_RECE_MN_SIZE;				/*CAN2接收数据邮箱长度*/
			TranMnPos=CAN2_TRAN_MN_POS;				/*CAN2发送数据邮箱位置*/
		break;
	};
	switch(baud)
	{
		case	CAN_1000:
			PreDivide=0;	/*预分频倍数为1*/
		break;
		case	CAN_500:
			PreDivide=1;	/*预分频倍数为2*/
		break;
		case	CAN_250:
			PreDivide=3;	/*预分频倍数为4*/
		break;
		case	CAN_200:
			PreDivide=4;	/*预分频倍数为5*/
		break;
		case	CAN_125:
			PreDivide=7;	/*预分频倍数为8*/
		break;
		case	CAN_100:
			PreDivide=9;	/*预分频倍数为10*/
		break;
		case	CAN_50:
			PreDivide=19;	/*预分频倍数为20*/
		break;
		default:
			PreDivide=1;	/*默认预分频倍数为2*/
		break;
	};
      /*==================================使能CAN0总线时钟========================================*/
	EnableCanClock(Channel);				            
	/*============================================================配置MCR==============================================================*/
      /*=================================Disable CAN模块===========================================*/
      if(((CanPoint->MCR & CAN_MCR_MDIS_MASK) >> CAN_MCR_MDIS_SHIFT) == 0U)
      {
            CanPoint->MCR = (CanPoint->MCR & ~CAN_MCR_MDIS_MASK) | CAN_MCR_MDIS(1U);
            while (((CanPoint->MCR & CAN_MCR_LPMACK_MASK) >> CAN_MCR_LPMACK_SHIFT) == 0U) {}
      }
      if((CanPoint->MCR & CAN_MCR_LPMACK_MASK) == 0U)
      {
            CanPoint->MCR = (CanPoint->MCR & ~CAN_MCR_MDIS_MASK) | CAN_MCR_MDIS(1U);
            while (((CanPoint->MCR & CAN_MCR_LPMACK_MASK) >> CAN_MCR_LPMACK_SHIFT) == 0U) {}
      };
	/*================================CAN进入CAN总线复位模式====================================*/  
		CanPoint->MCR = (CanPoint->MCR & ~CAN_MCR_SOFTRST_MASK) | CAN_MCR_SOFTRST(1U);		
		while (((CanPoint->MCR & CAN_MCR_FRZACK_MASK) >> CAN_MCR_FRZACK_SHIFT) != 0U) {}
		while ((CanPoint->MCR & CAN_MCR_SOFTRST_MASK)==0) {};      /*等待复位完成*/
      /*===================================使能CAN模块=============================================*/      
      if(((CanPoint->MCR & CAN_MCR_MDIS_MASK) >> CAN_MCR_MDIS_SHIFT))
      {
            CanPoint->MCR=CanPoint->MCR & 0X7FFFFFFF;				
            while (((CanPoint->MCR & CAN_MCR_LPMACK_MASK) >> CAN_MCR_LPMACK_SHIFT)) {};     
      };           
      /*=================================CAN模块进入Freeze模式====================================*/
      CanPoint->MCR = (CanPoint->MCR & ~CAN_MCR_FRZ_MASK) | CAN_MCR_FRZ(1U);
      if((CanPoint->MCR & CAN_MCR_HALT_MASK)==0)
      {
            CanPoint->MCR = (CanPoint->MCR & ~CAN_MCR_HALT_MASK) | CAN_MCR_HALT(1U);
            while (((CanPoint->MCR & CAN_MCR_FRZACK_MASK) >> CAN_MCR_FRZACK_SHIFT) == 0U) {}
      };
      
      /*================================接收缓冲区=================================================*/
      CanPoint->RXMGMASK=0;
      CanPoint->RX14MASK=0;
      
      CanPoint->MCR=CanPoint->MCR | CAN_MCR_SRXDIS(1);            /*关闭发送,接收自循环*/

      CanPoint->RX15MASK=0;      
      CanPoint->IMASK1=0;                                         /*关闭MB中断*/
	/*============================================清除消息缓冲区===============================================*/
	MnPos=0;								/*初始值为0*/
	while(MnPos<(ReceMnSize + 1)*4)		/*初始化接收邮箱*/
	{
		CanPoint->RAMn[MnPos]=0X0;					      /*不激活状态*/
		MnPos++;
	};
	/*=========================================================================================================*/
      CanPoint->MCR=CanPoint->MCR | CAN_MCR_RFEN(1);              /*CAN总线接收FIFO模式*/
      CanPoint->RXFGMASK=0;                                       /*FIFO全局屏蔽寄存器*/
      CanPoint->MCR=CanPoint->MCR | CAN_MCR_DMA(1);               /*CAN总线接收DMA模式*/
      
	CanPoint->MCR=(CanPoint->MCR & 0XFFFFFF00)+ (ReceMnSize+1);	/*MB邮箱数量*/
	/*===============配置CTRL1===============*/
	CanPoint->CTRL1=CAN_CTRL1_PRESDIV(PreDivide) | CAN_CTRL1_PSEG2(2) | CAN_CTRL1_PSEG1(2) | CAN_CTRL1_LBUF(1);
	/*===============配置CBT==================*/
	CanPoint->CBT=CAN_CBT_EPSEG2(2) | CAN_CBT_EPSEG1(2)| CAN_CBT_EPRESDIV(PreDivide);
	/*================================CAN模块离开Freeze模式================================*/
      CanPoint->MCR = (CanPoint->MCR & ~CAN_MCR_FRZ_MASK) | CAN_MCR_FRZ(0U);
      while (((CanPoint->MCR & CAN_MCR_FRZACK_MASK) >> CAN_MCR_FRZACK_SHIFT) != 0U) {}      
	/*================================配置CAN总线发送/接收邮箱=============================*/
      /*============================================设置接收邮箱===============================================*/
//	MnPos=0;								/*初始值为0*/
//	while(MnPos<ReceMnSize)		/*初始化接收邮箱*/
//	{
//		CanPoint->RAMn[MnPos*4]=0X0;					      /*不激活状态*/
//            CanPoint->RAMn[MnPos*4+1]=0X1FFFFFFF;
//		CanPoint->RAMn[MnPos*4]=0X04000000;					/*定义为接受缓冲区，活跃状态*/
//            CanPoint->RXIMR[MnPos]=0;                                   /*接收掩码寄存器*/
//		MnPos++;
//	};
//      CanPoint->RAMn[0]=0X04000000;	
//      CanPoint->RXIMR[0]=0;                                   /*接收掩码寄存器*/
//      PreDivide=CanPoint->TIMER;             /*接收邮箱解锁*/
//	MnPos=1;								/*初始值为0*/
//	while(MnPos<ReceMnSize)		/*初始化接收邮箱*/
//	{
//		CanPoint->RAMn[MnPos*4]=0X0;					      /*不激活状态*/
//            CanPoint->RAMn[MnPos*4+1]=0XFFFFFFFF;
//		CanPoint->RAMn[MnPos*4]=0X04000000;					/*定义为接受缓冲区，活跃状态*/
//		MnPos++;
//	};
//      CanPoint->RAMn[24]=0;
//      CanPoint->RAMn[25]=0;
//      CanPoint->RAMn[26]=0;
//      CanPoint->RAMn[27]=0;
//      CanPoint->RAMn[28]=0;
//      CanPoint->RAMn[29]=0;
//      CanPoint->RAMn[30]=0;
//      CanPoint->RAMn[31]=0;
//      /*=========================================设置发送邮箱位置===============================================*/	
	CanPoint->RAMn[TranMnPos*4]=0X08;					/*定义为发送缓冲区，不活跃状态*/
};
