zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
/*====================================================发送CAN数据================================================
	返回值:
            0：发送成功。
            -1：发送缓冲区忙，无法进行本次发送。
	参数:
		Channel：CAN模块号，这是一个CANCHANNEL变量，表示CAN的三个模块{CanChannel0 ,CanChannel1 ,CanChannel2}
		CanData:CAN报文缓冲区数据结构.
================================================================================================================*/
int  	TranCan(CANCHANNEL Channel,struct  	CAN_MESSAGE_BUFFER *CanData)
{
unsigned int	TransPos;		/*CAN发送邮箱位置*/
unsigned int	TransCode;		/*发送邮箱命令代码*/	
CAN_Type *CanPoint;
	switch(Channel)
	{
		case	CanChannel0:
			CanPoint=(CAN_Type *)CAN0_BASE;			/*设置相应的CAN指针首地址*/
			TransPos=CAN0_TRAN_MN_POS;				/*CAN0发送数据邮箱位置*/
		break;
		case	CanChannel1:
			CanPoint=(CAN_Type *)CAN1_BASE;			/*设置相应的CAN指针首地址*/
			TransPos=CAN1_TRAN_MN_POS;				/*CAN1发送数据邮箱位置*/
		break;
		case	CanChannel2:
			CanPoint=(CAN_Type *)CAN2_BASE;			/*设置相应的CAN指针首地址*/
			TransPos=CAN2_TRAN_MN_POS;				/*CAN2发送数据邮箱位置*/
		break;
	};
	TransCode=((CanPoint->RAMn[TransPos * 4]>> 24) & 0X0F );	/*得出当前邮箱的命令代码*/
	if((TransCode==CAN_MB_TX_INACTIVE) || (TransCode==CAN_MB_RX_INACTIVE))	/*发送邮箱处于不活跃状态,可以发送数据*/
	{
		CanData->CODE=CAN_MB_TX_DATA;		/*发送邮箱处于发送状态,无条件发送数据一次*/
            CanPoint->RAMn[TransPos*4+2]=CAN_RAMn_DATA_BYTE_3(CanData->Data[3])+CAN_RAMn_DATA_BYTE_2(CanData->Data[2])+CAN_RAMn_DATA_BYTE_1(CanData->Data[1])+CAN_RAMn_DATA_BYTE_0(CanData->Data[0]);
            CanPoint->RAMn[TransPos*4+3]=CAN_RAMn_DATA_BYTE_3(CanData->Data[7])+CAN_RAMn_DATA_BYTE_2(CanData->Data[6])+CAN_RAMn_DATA_BYTE_1(CanData->Data[5])+CAN_RAMn_DATA_BYTE_0(CanData->Data[4]);
		(void)memcpy((unsigned char *)&(CanPoint->RAMn[TransPos * 4]),(unsigned char *)CanData,8);
            return 0;
	}else
      {     
            return -1;
      }
};
/*==================================================读取CAN报文缓冲区接收数据=======================================
	返回值：
            0：CAN接收缓冲区中没有数据。
            1：CAN接收缓冲区中有有效的CAN数据。
	参数：
		Channel：CAN模块号，这是一个CANCHANNEL变量，表示CAN的三个模块{CanChannel0 ,CanChannel1 ,CanChannel2}
		CanData:CAN报文缓冲区数据结构。
==================================================================================================================*/
int	ReadCanData(CANCHANNEL Channel,struct  CAN_MESSAGE_BUFFER *CanData)
{
struct CAN_MESSAGE_BUFFER *CanPoint;
int	ReceMbSize;		      /*CAN接收邮箱长度*/ 
int	MbPosition;	            /*DMA接受CAN缓冲区位置*/
int   *TempReadPosition;      /*当前读缓接收冲区位置*/
	switch(Channel)
	{
		case	CanChannel0:
			CanPoint=Can0ReceBuffer;			/*设置相应的接收缓冲区首地址*/
			ReceMbSize=CAN0_RECE_BUFF_SIZE;	      /*CAN0收缓冲长度*/
                  MbPosition=CAN0_RECE_BUFF_SIZE - (DMA->TCD[15].CITER.ELINKNO);      /*DMA通道当前写入接收缓冲区位置*/
                  TempReadPosition=&Can0RecePosition;
		break;
		case	CanChannel1:
			CanPoint=Can1ReceBuffer;			/*设置相应的接收缓冲区首地址*/
			ReceMbSize=CAN1_RECE_BUFF_SIZE;	      /*CAN1收缓冲长度*/
                  MbPosition=CAN1_RECE_BUFF_SIZE - (DMA->TCD[14].CITER.ELINKNO);      /*DMA通道当前写入接收缓冲区位置*/
                  TempReadPosition=&Can1RecePosition;
		break;
		case	CanChannel2:
			CanPoint=Can2ReceBuffer;			/*设置相应的接收缓冲区首地址*/
			ReceMbSize=CAN2_RECE_BUFF_SIZE;	      /*CAN2收缓冲长度*/
                  MbPosition=CAN2_RECE_BUFF_SIZE - (DMA->TCD[13].CITER.ELINKNO);      /*DMA通道当前写入接收缓冲区位置*/
                  TempReadPosition=&Can2RecePosition;
		break;
	};
	if(*TempReadPosition != MbPosition)		/*接收缓冲区接收到新的数据*/
	{
                  memcpy(CanData , (unsigned char *)(&CanPoint[*TempReadPosition]) , 8);   /*取出控制子与ID信息*/
                  CanData->Data[0]=CanPoint[*TempReadPosition].Data[3];
                  CanData->Data[1]=CanPoint[*TempReadPosition].Data[2];
                  CanData->Data[2]=CanPoint[*TempReadPosition].Data[1];
                  CanData->Data[3]=CanPoint[*TempReadPosition].Data[0];
                  CanData->Data[4]=CanPoint[*TempReadPosition].Data[7];
                  CanData->Data[5]=CanPoint[*TempReadPosition].Data[6];
                  CanData->Data[6]=CanPoint[*TempReadPosition].Data[5];
                  CanData->Data[7]=CanPoint[*TempReadPosition].Data[4];
                  (*TempReadPosition)++;     /*指针移动一位*/
                  if(*TempReadPosition >= ReceMbSize) *TempReadPosition=0;  /*接受缓冲区为循环队列*/   
                  return 1;
	}else       /*接收缓冲区没有收到新的数据*/
      {
            return 0;
      };
};
/*=====================================================队列发送CAN数据========================================================
	返回值:
            0：发送成功。
            -1：发送缓冲区忙，无法进行本次发送。
	参数:
		Channel：CAN模块号，这是一个CANCHANNEL变量，表示CAN的三个模块{CanChannel0 ,CanChannel1 ,CanChannel2}
		CanData:CAN报文缓冲区数据结构.
============================================================================================================================*/
int      CANTranQueue(CANCHANNEL Channel,struct  CAN_MESSAGE_BUFFER *CanData)
{
int  *TempTopPoint,*TempTailPoint;
int   TempSize,TempValue;
struct CAN_MESSAGE_BUFFER     *TempBuff;
      DISABLE_INTERRUPTS();         /*关闭任务调度*/
	switch(Channel)
	{
		case	CanChannel0:                        /*CAN0发送缓冲区头尾指针*/
			TempTopPoint=&Can0TranTop;
			TempTailPoint=&Can0TranTail;
                  TempSize=CAN0_TRAN_BUFF_SIZE;       /*CAN0发送缓冲区长度*/
                  TempBuff=Can0TranBuffer;
		break;
		case	CanChannel1:                        /*CAN1发送缓冲区头尾指针*/
			TempTopPoint=&Can1TranTop;
			TempTailPoint=&Can1TranTail;
                  TempSize=CAN1_TRAN_BUFF_SIZE;       /*CAN1发送缓冲区长度*/
                  TempBuff=Can1TranBuffer;
		break;
		case	CanChannel2:                        /*CAN2发送缓冲区头尾指针*/
			TempTopPoint=&Can2TranTop;
			TempTailPoint=&Can2TranTail;
                  TempSize=CAN2_TRAN_BUFF_SIZE;       /*CAN2发送缓冲区长度*/
                  TempBuff=Can2TranBuffer;
		break;
	};
      TempValue=*TempTailPoint + 1;
      if(TempValue>=TempSize) TempValue=0;      /*循环队列*/
      if(TempValue != *TempTopPoint)      /*发送缓冲区有有效的位置*/
      {
            *TempTailPoint=TempValue;     /*修改发送队列尾指针*/
            memcpy((unsigned char *)&TempBuff[TempValue],(unsigned char *)CanData,16);    /*将要发送的数据拷贝到发送缓冲区中*/
            ENABLE_INTERRUPTS();          /*使能任务调度*/
            return 0;
      }else
      {
            ENABLE_INTERRUPTS();          /*使能任务调度*/
            return -1;  /*发送缓冲区已经满,发送数据失败*/
      }
      
