zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
};
/*======================================================DMA初始化模块======================================================*/
void DmaInitial(void)
{
      /*======================================设置DMAMUX通道,并使能=======================================*/
      DMAMUX->CHCFG[15]=0;          /*DMA通道15为CAN0接收FIFO,使能DMA通道15*/
	
	
      DMAMUX->CHCFG[12]=0;          /*DMA通道12为FLEX_IO接收,使能DMA通道12*/
	
	
      DMAMUX->CHCFG[0]=0;          /*DMA通道0为驾驶员座椅驱动数据接收,使能DMA通道0*/
      DMAMUX->CHCFG[1]=0;          /*DMA通道1为前排乘员座椅驱动数据接收,使能DMA通道1*/


      DMAMUX->CHCFG[15]=DMAMUX_CHCFG_ENBL(1) | DMA_CAN0_SOURCE;         /*DMA通道15为CAN0接收FIFO,使能DMA通道15*/

      DMAMUX->CHCFG[12]=DMAMUX_CHCFG_ENBL(1) | DMA_FLEXIO_SHIFTER0_SOURCE;         /*DMA通道12为FLEX_IO接收,使能DMA通道12*/
	
      DMAMUX->CHCFG[0]=DMAMUX_CHCFG_ENBL(1) | FMT0_DMA_SOURCE;         /*DMA通道0为驾驶员座椅驱动数据接收,使能DMA通道0*/
      DMAMUX->CHCFG[1]=DMAMUX_CHCFG_ENBL(1) | FTM1_CH1_DMA_SROUCE;     /*DMA通道1为前排乘员座椅驱动数据接收,使能DMAFTM1模块通道1 DMA源*/
            
//      DMAMUX->CHCFG[12]=DMAMUX_CHCFG_ENBL(1) | DMA_SPI0_RECE_SOURCE;    /*SPI0通道RX DMA源*/
//      DMAMUX->CHCFG[11]=DMAMUX_CHCFG_ENBL(1) | DMA_SPI0_TRAN_SOURCE;    /*SPI0通道TX DMA源*/
      
//      DMAMUX->CHCFG[10]=DMAMUX_CHCFG_ENBL(1) | DMA_SPI1_RECE_SOURCE;    /*SPI0通道RX DMA源*/
//      DMAMUX->CHCFG[9]= DMAMUX_CHCFG_ENBL(1) | DMA_SPI1_TRAN_SOURCE;    /*SPI0通道TX DMA源*/
      
      /*===========================================设置EDMA参数==========================================*/
      DMA->CR=DMA_CR_CLM(1) | DMA_CR_ERCA(1) | DMA_CR_EMLM(1);  /*小循环使能*/
      
      /*=========================================EDMA设置初始化==============================================*/
      DMA->DCHPRI[15]=DMA_DCHPRI_CHPRI(15)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);         /*CAN0通道DMA优先级*/

      DMA->DCHPRI[12]=DMA_DCHPRI_CHPRI(12)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);         /*FLEX_IO接收通道DMA优先级*/

      DMA->DCHPRI[0]=DMA_DCHPRI_CHPRI(0)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);         	/*驾驶员座椅驱动通道DMA优先级*/
      DMA->DCHPRI[1]=DMA_DCHPRI_CHPRI(1)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);         	/*前排乘员座椅驱动通道DMA优先级*/
//      DMA->DCHPRI[12]=DMA_DCHPRI_CHPRI(12)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);         /*SPI0 RECE通道DMA优先级*/
//      DMA->DCHPRI[11]=DMA_DCHPRI_CHPRI(11)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);         /*SPI0 TRAN通道DMA优先级*/
//      DMA->DCHPRI[10]=DMA_DCHPRI_CHPRI(10)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);         /*SPI1 RECE通道DMA优先级*/
//      DMA->DCHPRI[9] =DMA_DCHPRI_CHPRI(9)| DMA_DCHPRI_DPA(1)| DMA_DCHPRI_ECP(1);          /*SPI1 TRAN通道DMA优先级*/
      
      /*================================设置DMA通道15的TCB配置(CAN0)=====================================*/
      DMA->TCD[15].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(CAN0_RECE_BUFF_SIZE);        /*在主循环内共计有CAN0_RECE_BUFF_SIZE个小循环*/
      DMA->TCD[15].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(CAN0_RECE_BUFF_SIZE);        /*在主循环内共计有CAN0_RECE_BUFF_SIZE个小循环*/
      DMA->TCD[15].NBYTES.MLOFFYES=DMA_TCD_NBYTES_MLOFFYES_NBYTES(16)|DMA_TCD_NBYTES_MLOFFYES_MLOFF(-16)|DMA_TCD_NBYTES_MLOFFYES_SMLOE(1);          /*DMA传输一次16个字节*/
      DMA->TCD[15].SADDR=DMA_TCD_SADDR_SADDR(&CAN0->RAMn[0]);           /*CAN0通道DMA传输源地址*/ 
      DMA->TCD[15].SOFF=4;                           /*DMA一次读写4个字节*/
      DMA->TCD[15].ATTR=DMA_TCD_ATTR_DSIZE(2) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(2) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,32位数据格式*/
      DMA->TCD[15].SLAST=DMA_TCD_SLAST_SLAST(-16);    /*主循环完成后源地址回调*/
      DMA->TCD[15].DADDR=DMA_TCD_DADDR_DADDR(&Can0ReceBuffer[0]);
      DMA->TCD[15].DOFF=4;                           /*DMA一次读写4个字节*/
      DMA->TCD[15].DLASTSGA=DMA_TCD_DLASTSGA_DLASTSGA(-16*CAN0_RECE_BUFF_SIZE);     /*主循环完成后目标地址回调*/
      DMA->TCD[15].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0);
      
//      /*================================设置DMA通道14的TCB配置(CAN1)=====================================*/
//      DMA->TCD[14].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(CAN1_RECE_BUFF_SIZE);         /*在主循环内共计有CAN1_RECE_BUFF_SIZE个小循环*/
//      DMA->TCD[14].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(CAN1_RECE_BUFF_SIZE);         /*在主循环内共计有CAN1_RECE_BUFF_SIZE个小循环*/
//      DMA->TCD[14].NBYTES.MLOFFYES=DMA_TCD_NBYTES_MLOFFYES_NBYTES(16)|DMA_TCD_NBYTES_MLOFFYES_MLOFF(-16)|DMA_TCD_NBYTES_MLOFFYES_SMLOE(1);      /*DMA传输一次16个字节*/
//      DMA->TCD[14].SADDR=DMA_TCD_SADDR_SADDR(&CAN1->RAMn[0]);           /*CAN0通道DMA传输源地址*/ 
//      DMA->TCD[14].SOFF=4;                           /*DMA一次读写4个字节*/
//      DMA->TCD[14].ATTR=DMA_TCD_ATTR_DSIZE(2) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(2) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,32位数据格式*/
//      DMA->TCD[14].SLAST=DMA_TCD_SLAST_SLAST(-16);    /*主循环完成后源地址回调*/
//      DMA->TCD[14].DADDR=DMA_TCD_DADDR_DADDR(&Can1ReceBuffer[0]);
//      DMA->TCD[14].DOFF=4;                           /*DMA一次读写4个字节*/
//      DMA->TCD[14].DLASTSGA=DMA_TCD_DLASTSGA_DLASTSGA(-16*CAN1_RECE_BUFF_SIZE);     /*主循环完成后目标地址回调*/
//      DMA->TCD[14].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0);
//      
//      /*================================设置DMA通道13的TCB配置(CAN2)=====================================*/
//      DMA->TCD[13].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(CAN2_RECE_BUFF_SIZE);        /*在主循环内共计有CAN2_RECE_BUFF_SIZE个小循环*/     
//      DMA->TCD[13].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(CAN2_RECE_BUFF_SIZE);        /*在主循环内共计有CAN2_RECE_BUFF_SIZE个小循环*/
//      DMA->TCD[13].NBYTES.MLOFFYES=DMA_TCD_NBYTES_MLOFFYES_NBYTES(16)|DMA_TCD_NBYTES_MLOFFYES_MLOFF(-16)|DMA_TCD_NBYTES_MLOFFYES_SMLOE(1);          /*DMA传输一次16个字节*/
//      DMA->TCD[13].SADDR=DMA_TCD_SADDR_SADDR(&CAN2->RAMn[0]);           /*CAN0通道DMA传输源地址*/ 
 //     DMA->TCD[13].SOFF=4;                           /*DMA一次读写4个字节*/
 //     DMA->TCD[13].ATTR=DMA_TCD_ATTR_DSIZE(2) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(2) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,32位数据格式*/
 //     DMA->TCD[13].SLAST=DMA_TCD_SLAST_SLAST(-16);    /*主循环完成后源地址回调*/
  //    DMA->TCD[13].DADDR=DMA_TCD_DADDR_DADDR(&Can2ReceBuffer[0]);
 //     DMA->TCD[13].DOFF=4;                           /*DMA一次读写4个字节*/
 //     DMA->TCD[13].DLASTSGA=DMA_TCD_DLASTSGA_DLASTSGA(-16*CAN2_RECE_BUFF_SIZE);     /*主循环完成后目标地址回调*/
 //     DMA->TCD[13].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0);
            


