zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
      DMA->SERQ=DMA_SERQ_SERQ(15);        /*使能CAN0通道DMA服务*/
//      DMA->SERQ=DMA_SERQ_SERQ(14);        /*使能CAN1通道DMA服务*/
//      DMA->SERQ=DMA_SERQ_SERQ(13);        /*使能CAN2通道DMA服务*/


};
#pragma arm section code = "RAMCODE"
/*=================================================EEPROM快速写入=====================================================*/
unsigned char  EepromQuickWrite(unsigned int Size)
{
      if(((SIM->FCFG1 & SIM_FCFG1_DEPART_MASK)>>SIM_FCFG1_DEPART_SHIFT)== EEPROM_DEPART)/*如果EEPROM没有分区代码,64KEFLASH*/
      {     /*===========EEPROM没有进行分区操作,对EEPROM进行分区==============*/
            /*======================设置FLEXRAM工作在仿真EEPROM模式================================================*/
            while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0)  __NOP();    /*等待上一次FLASH操作完成*/
            FTFC->FSTAT=FTFC_FSTAT_ACCERR(1) | FTFC_FSTAT_FPVIOL(1) |FTFC_FSTAT_RDCOLERR(1);    /*清除相关报警*/
            FTFC->FCCOB[3]=EEPROM_SE_FlEXRAM;   /*设置FLEXRAM工作模式FCCOB0*/
            FTFC->FCCOB[2]=EEPROM_QUICK_WRITE;  /*FLEXRAM快速写入操作,FCCoB1*/
            FTFC->FCCOB[1]=0;
            FTFC->FCCOB[0]=0;
            FTFC->FCCOB[7]=Size>>8;
            FTFC->FCCOB[6]=Size & 0XFF;
            FTFC->FSTAT=FTFC_FSTAT_CCIF(1);     /*开始执行FLASH擦除命令,写1清除*/
            while(((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0) || ((FTFC->FCNFG & FTFC_FCNFG_EEERDY_MASK) ==0)) __NOP();    /*等待FLASH操作完成*/
      };
      return FTFC->FCCOB[6];
};
/*======================================================FLEXRAM分区命令=============================================*/
void  FlexRamParden(void)
{
      if(((SIM->FCFG1 & SIM_FCFG1_DEPART_MASK)>>SIM_FCFG1_DEPART_SHIFT)!= EEPROM_DEPART)/*如果EEPROM没有分区代码,64KEFLASH*/
      {     /*===========EEPROM没有进行分区操作,对EEPROM进行分区==============*/
            while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0) {} ;    /*等待上一次FLASH操作完成*/
            FTFC->FSTAT=FTFC_FSTAT_ACCERR(1) | FTFC_FSTAT_FPVIOL(1) |FTFC_FSTAT_RDCOLERR(1);    /*清除相关报警*/
            FTFC->FCCOB[3]=EEPROM_PGMPART;      /*对EEPROM进行分区FCCOB0*/
            FTFC->FCCOB[2]=0;                   /*FCCOB1*/
            FTFC->FCCOB[1]=0;                   /*FCCOB2*/
            FTFC->FCCOB[0]=1;                   /*FCCOB3,系统复位后不用自动装载EEPROM数据*/
            FTFC->FCCOB[7]=EEPROM_EEESIZE;      /*EEPROM大小:2KByte,FCCOB4*/
            FTFC->FCCOB[6]=EEPROM_DEPART;       /*EEPROM分区代码,64KEFLASH,FCCOB5*/
            FTFC->FSTAT=FTFC_FSTAT_CCIF(1);     /*开始执行FLASH擦除命令,写1清除*/
            while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0)  {};    /*等待命令完成*/
      };
};
/*========================================擦除BaseAddress地址范围的Flash扇区(4K)=================================================*/
void EraseFlashSector(unsigned int  BaseAddress)
{
      while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0)  __NOP();    /*等待上一次FLASH操作完成*/
      FTFC->FSTAT=FTFC_FSTAT_ACCERR(1) | FTFC_FSTAT_FPVIOL(1) |FTFC_FSTAT_RDCOLERR(1);    /*清除相关报警*/
      FTFC->FCCOB[3]=ERASR_FLASH_SECTOR;        /*擦除FLASH扇区中的所有数据*/
      FTFC->FCCOB[2]=(unsigned char)(BaseAddress>>16);
      FTFC->FCCOB[1]=(unsigned char)(BaseAddress>>8);
      FTFC->FCCOB[0]=(unsigned char)BaseAddress;
      FTFC->FSTAT=FTFC_FSTAT_CCIF(1);     /*开始执行FLASH擦除命令,写1清除*/
      while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0)  __NOP();    /*等待命令完成*/
};
/*===========================================在FLASH给定地址编程=============================================================*/
void  WriteFlash(unsigned int  FlashAddress,unsigned char *ReceDataBuff)
{
      while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0)  __NOP();    /*等待上一次FLASH操作完成*/
      FTFC->FSTAT=FTFC_FSTAT_ACCERR(1) | FTFC_FSTAT_FPVIOL(1) |FTFC_FSTAT_RDCOLERR(1);    /*清除相关报警*/
      FTFC->FCCOB[3]=PROGRAM_FLASH;                               /*对FLASH进行一次写入程序*/
      FTFC->FCCOB[2]=(unsigned char)(FlashAddress>>16);
      FTFC->FCCOB[1]=(unsigned char)(FlashAddress>>8);
      FTFC->FCCOB[0]=(unsigned char)FlashAddress;
      FTFC->FCCOB[4]=ReceDataBuff[0];
      FTFC->FCCOB[5]=ReceDataBuff[1];
      FTFC->FCCOB[6]=ReceDataBuff[2];
      FTFC->FCCOB[7]=ReceDataBuff[3];
      FTFC->FCCOB[8]=ReceDataBuff[4];
      FTFC->FCCOB[9]=ReceDataBuff[5];
      FTFC->FCCOB[10]=ReceDataBuff[6];
      FTFC->FCCOB[11]=ReceDataBuff[7];
      FTFC->FSTAT=FTFC_FSTAT_CCIF(1);     /*开始执行FLASH擦除命令,写1清除*/
      while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0)  __NOP();    /*等待命令完成*/
};
#pragma arm section
/*=================================================写入EEPROM数据(32位)===========================================================*/
void  WriteEepromData(unsigned int *Target,unsigned int  *Source,unsigned int size)
{
unsigned int cycles = size / 4;
unsigned int remain = size % 4;
unsigned int offset=0;
      DISABLE_INTERRUPTS();         /*关闭任务调度*/
	for (int i=0;i<cycles;i++)
	{
		while ((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK) == 0){};
		*((int*)(Target + offset))=*((int*)(Source + offset));
		offset ++;
	}
	for (int i=0;i<remain;i++)
	{
            while ((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK) == 0){};
            *((char*)Target + offset)=*((char*)Source + offset);
            offset++;
      };
      __NOP();
      while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0) {} ;    /*等待命令完成*/
      ENABLE_INTERRUPTS();          /*使能任务调度*/
};
/*=================================================写入EEPROM数据(16位)===========================================================*/
void  WriteEepromShort(unsigned short *Target,unsigned short  *Source,unsigned int size)
{
unsigned int offset=0;
      DISABLE_INTERRUPTS();         /*关闭任务调度*/
	for (int i=0;i<size;i++)
	{
            while ((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK) == 0){};
            *(Target + offset)=*(Source + offset);
            offset++;
      };
      __NOP();
      __NOP();
      while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0) {} ;    /*等待命令完成*/
      ENABLE_INTERRUPTS();          /*使能任务调度*/
};

/*==============================================设置FLEXRAM为EEPROM仿真模式=========================================*/
void  FlexramEeprom(void)
{
      if((FTFC->FCNFG & FTFC_FCNFG_EEERDY_MASK)==0)   /*系统内部EEPROM没准备好*/
      {
            while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0) {};    /*等待上一次FLASH操作完成*/
            FTFC->FSTAT=FTFC_FSTAT_ACCERR(1) | FTFC_FSTAT_FPVIOL(1) |FTFC_FSTAT_RDCOLERR(1);    /*清除相关报警*/
            FTFC->FCCOB[3]=EEPROM_SE_FlEXRAM;         /*设置FLEXRAM工作模式FCCOB0*/
            FTFC->FCCOB[2]=EEPROM_EMULATED;           /*FLEXRAM工作在仿真EEPROM模式,FCCOB1*/
            FTFC->FSTAT=FTFC_FSTAT_CCIF(1);           /*开始执行FLASH擦除命令,写1清除*/
            while((FTFC->FSTAT & FTFC_FSTAT_CCIF_MASK)==0) {} ;    /*等待命令完成*/
      }
};
/*==============================================初始化QSPI模块=====================================================
      功能说明:
            初始化低功耗SPI模块,设定SPI通讯的前端频率为4MHz,后端通讯频率又命令字分频决定.
      参数:
            Channel:定义使用的SPI模块通道,一共有三个SPI通道(SpiChannel0,SpiChannel0,SpiChannel0)
            DmaMode:定义SPI是否使用DMA通讯,1:启动DMA;0:不启动DMA;
===================================================================================================================*/
void  InitLPSpi(SPICHANNEL Channel,unsigned int DmaMode)
{
LPSPI_Type  *LPSpiPoint;

      switch(Channel)
      {
            case  SpiChannel0:
                  LPSpiPoint=LPSPI0;
                  PCC->PCCn[PCC_LPSPI0_INDEX] = 0;                /* Disable clocks to modify PCS ( default) */
                  PCC->PCCn[PCC_LPSPI0_INDEX] = 0xC6000000;       /* Enable PCS=SPLL_DIV2 (40 MHz func'l clock) */
                  break;
            case  SpiChannel1:
                  LPSpiPoint=LPSPI1;
                  PCC->PCCn[PCC_LPSPI1_INDEX] = 0;                /* Disable clocks to modify PCS ( default) */
                  PCC->PCCn[PCC_LPSPI1_INDEX] = 0xC6000000;       /* Enable PCS=SPLL_DIV2 (40 MHz func'l clock) */
                  break;
            case  SpiChannel2:
                  LPSpiPoint=LPSPI2;
                  PCC->PCCn[PCC_LPSPI2_INDEX] = 0;                /* Disable clocks to modify PCS ( default) */
                  PCC->PCCn[PCC_LPSPI2_INDEX] = 0xC6000000;       /* Enable PCS=SPLL_DIV2 (40 MHz func'l clock) */
                  break;
      };
      LPSpiPoint->CR=0;       /*配置关闭形影的SPI模块*/
      LPSpiPoint->IER=0;      /*配置关闭SPI模块中断响应*/
      if(DmaMode == 1) LPSpiPoint->DER=0X03;   /*启动对应SPI模块的DMA传输功能*/
      else LPSpiPoint->DER=0;       /*禁止对应SPI模块的DMA传输功能*/
      LPSpiPoint->CFGR0=0;    /*接收数据匹配禁止、FIFO循环禁止、主机请求禁止、*/
      LPSpiPoint->CFGR1=0X04000001; /*外设片选使能、片选关闭后输出为三态、Sin输出输入、Sout为数据输出、输入匹配禁止、外设片选低有效、自动片选上拉禁止、SPI工作在主模式*/
//      LPSpiPoint->CCR=0X03030308;   /*SCKPCS=3+1、PCSSCK=3+1、DBT=3+2、SCKDIV=8+2（4MHz）*/
      LPSpiPoint->CCR=0X13130308;   /*SCKPCS=19+1、PCSSCK=19+1、DBT=3+2、SCKDIV=8+2（4MHz）*/
      LPSpiPoint->FCR=0X00000003;   /*RXWATER=0,Rx的FIFO>0产生RX标志；TXWATER=3，TX的FIFO<3产生TX标志*/
      LPSpiPoint->CR=0X00000009;    /*使能相应的LPSpi模块*/
};
/*========================================================InitATD初始化A/D转换=====================================================================*/
void InitATD(void)
{
      PCC->PCCn[PCC_ADC0_INDEX]=0;
//      PCC->PCCn[PCC_ADC1_INDEX]=0;
      PCC->PCCn[PCC_ADC0_INDEX]=PCC_PCCn_PCS(1) | PCC_PCCn_CGC(1);      /*使能ADC0gonzuo时钟,PCS-=1*/
//      PCC->PCCn[PCC_ADC1_INDEX]=PCC_PCCn_PCS(1) | PCC_PCCn_CGC(1);      /*使能ADC0gonzuo时钟,PCS-=1*/
      /*==================================ADC0模块设置=============================================*/
      ADC0->CFG1 = 0x000000004;     /* ADICLK=0: Input clk=ALTCLK1=SOSCDIV2 */
                                    /* ADIV=0: Prescaler=1 */
                                    /* MODE=1: 12-bit conversion */
      ADC0->CFG2 = 0x00000000C;     /* SMPLTS=12(default): sample time is 13 ADC clks */
      ADC0->SC2 = 0x00000000;       /* ADTRG=0: SW trigger */
                                    /* ACFE,ACFGT,ACREN=0: Compare func disabled */
                                    /* DMAEN=0: DMA disabled */
                                    /* REFSEL=0: Voltage reference pins= VREFH, VREEFL */
      ADC0->SC3 = 0x00000007;       /* CAL=0: Do not start calibration sequence */
                                    /* ADCO=0: One conversion performed */
                                    /* AVGE=1,AVGS=32: HW average function disabled */      
      /*==================================ADC1模块设置=============================================*/
//      ADC1->CFG1 = 0x000000004;     /* ADICLK=0: Input clk=ALTCLK1=SOSCDIV2 */
                                    /* ADIV=0: Prescaler=1 */
                                    /* MODE=1: 12-bit conversion */
//      ADC1->CFG2 = 0x00000000C;     /* SMPLTS=12(default): sample time is 13 ADC clks */
//      ADC1->SC2 = 0x00000000;       /* ADTRG=0: SW trigger */
                                    /* ACFE,ACFGT,ACREN=0: Compare func disabled */
                                    /* DMAEN=0: DMA disabled */
                                    /* REFSEL=0: Voltage reference pins= VREFH, VREEFL */
//      ADC1->SC3 = 0x00000007;       /* CAL=0: Do not start calibration sequence */
                                    /* ADCO=0: One conversion performed */
                                    /* AVGE=1,AVGS=32: HW average function disabled */      
};
/*=======================================================设置ADC自动校正功能===================================================================*/
void AutoCalibrationATD(void)
{
      /*========================自动校正ADC0===========================*/
      ADC0->CLPS = 0x00u;
      ADC0->CLP3 = 0x00u;
      ADC0->CLP2 = 0x00u;
      ADC0->CLP1 = 0x00u;
      ADC0->CLP0 = 0x00u;
      ADC0->CLPX = 0x00u;
      ADC0->CLP9 = 0x00u;
      ADC0->SC3 =ADC0->SC3 | 0X80;  /*启动自动校正*/
      while(ADC0->SC3 & 0X80){};
      /*========================自动校正ADC1===========================*/
//      ADC1->CLPS = 0x00u;
//      ADC1->CLP3 = 0x00u;
//      ADC1->CLP2 = 0x00u;
//      ADC1->CLP1 = 0x00u;
//      ADC1->CLP0 = 0x00u;
//      ADC1->CLPX = 0x00u;
//      ADC1->CLP9 = 0x00u;
//      ADC1->SC3 =ADC1->SC3 | 0X80;  /*启动自动校正*/
//      while(ADC1->SC3 & 0X80){};

