zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
};
/*=========================================================批量启动A/D转换======================================================================*/
void  StartAtdConver(void)
{
//      /*===============================ATD0通道切换====================================================*/
      ADC0->SC1[0]&=~ADC_SC1_ADCH_MASK;         /* Clear prior ADCH bits */
      ADC0->SC1[0] = ADC_SC1_ADCH(Atd0Pos);     /*启动A/D转换*/
//      /*================================ATD1通道切换====================================================*/
//      ADC1->SC1[0]&=~ADC_SC1_ADCH_MASK;         /* Clear prior ADCH bits */
//      ADC1->SC1[0] = ADC_SC1_ADCH(Atd1Pos);     /*启动A/D转换*/
};

/*======================================================获得A/D转换结果===============================================================*/
void  GetAtdResult(void)
{
unsigned  int     TempResult;
      /*=======================================获取ATD0模块A/D转换结果数值============================================*/
	TempResult=ADC0->R[0];			/*取出上一次A/D转换结果*/
      switch(Atd0Pos)
      {
            case  UB_VOLTAGE_CHANNEL:        			/*系统供电UB电压A/D转换通道*/
			UbVoltageBuff=UbVoltageBuff + TempResult - UbVoltageValue;
			UbVoltageValue=UbVoltageBuff / ATD_FILTER_SCALE;
			UbVoltage=UbVoltageValue * 900 / 1024;	/*UB电压值，精度0.01V*/
                  Atd0Pos=AD2428_VOUT2_CHANNEL;			/*AD2424输出电压Vout电压A/D转换通道*/
                  break;
            case  AD2428_VOUT2_CHANNEL:				/*AD2424输出电压Vout电压A/D转换通道*/
			Ad2428Vout2Buff=Ad2428Vout2Buff + TempResult - Ad2428Vout2Value;
			Ad2428Vout2Value=Ad2428Vout2Buff / ATD_FILTER_SCALE;
			Ad2428Vout2= Ad2428Vout2Value * 125 / 1024;	/*AD2428输出电压Vout2电压值，精度0.01V*/
                  Atd0Pos=AD2428_POWER_CHANNEL;			/*AD 2428供电电压A/D转换通道*/
                  break;
            case  AD2428_POWER_CHANNEL:          		/*AD 2428供电电压A/D转换通道*/
			Ad2428PowerBuff=Ad2428PowerBuff + TempResult - AD2428PowerValue;
			AD2428PowerValue=Ad2428PowerBuff / ATD_FILTER_SCALE;
			Ad2428Power=AD2428PowerValue 	* 125 / 512;		/*AD2428供电电压值，精度0.01V*/
                  Atd0Pos=UB_VOLTAGE_CHANNEL;        		/*系统供电UB电压A/D转换通道*/
                  break;
      };
};
/*====================================初始化PWM特征捕捉功能==============================================================*/
void  InitFtm2Capture(void)
{
      PCC->PCCn[PCC_FTM2_INDEX]=0;
      PCC->PCCn[PCC_FTM2_INDEX]=PCC_PCCn_PCS(1) | PCC_PCCn_CGC(1);      /*使能FTM1模块时钟,PCS-=1*/
      FTM2->MODE=FTM_MODE_WPDIS(1);       /*FTM1寄存器保护模式取消,可以输入数据; FTMEN=0*/
      FTM2->SC =0X00000003;         /* TOIE (Timer Overflow Interrupt Ena) = 0 (default) */
                                    /* CPWMS (Center aligned PWM Select) = 0 (default, up count) */
                                    /* CLKS (Clock source) = 0 (default, no clock; FTM disabled) */
                                    /* PS (Prescaler factor) = 3. Prescaler = 8 */
      FTM2->MOD=0;                  /*定时器模为0*/
      FTM2->CNTIN=0;                /*定时器初值为0*/
      FTM2->FILTER=FTM_FILTER_CH0FVAL(3);       /*2uS的滤波时间*/
      FTM2->COMBINE =0X0000000C;    /* FTM mode settings used: DECAP0=1, DECAPEN0=1, MCOMBINEx=0, COMBINEx=0 */    
      FTM2->SC =FTM2->SC | FTM_SC_CLKS(3);      /*定时器开始启动*/
}
/*===================================开始捕捉PWM输入特征=================================================================
输入参数:
      Mode:工作模式,0:捕捉PWM高电平时间;1:捕捉PWM周期时间,精度为1uS
=======================================================================================================================*/
void  StartFtm2Capture(unsigned int Mode)
{
      if(Mode)    /*捕捉周期长度*/
      {
            FTM2->CONTROLS[0].CnSC=0X00000014;        /*捕捉上升沿,连续模式*/      
            FTM2->CONTROLS[1].CnSC=0X00000004;        /*捕捉上升沿*/
      }else       /*捕捉高电平长度*/
      {
            FTM2->CONTROLS[0].CnSC=0X00000014;        /*捕捉上升沿,连续模式*/      
            FTM2->CONTROLS[1].CnSC=0X00000008;        /*捕捉下降沿*/
      };
      if(FTM2->CONTROLS[0].CnSC & FTM_CnSC_CHF_MASK) FTM2->CONTROLS[0].CnSC=FTM2->CONTROLS[0].CnSC & (~FTM_CnSC_CHF_MASK);  /*清除标志位*/
      if(FTM2->CONTROLS[1].CnSC & FTM_CnSC_CHF_MASK) FTM2->CONTROLS[1].CnSC=FTM2->CONTROLS[1].CnSC & (~FTM_CnSC_CHF_MASK);  /*清除标志位*/
};
/*======================================读PWM特征数据================================================================
输入参数:
      Mode:工作模式,0:捕捉PWM高电平时间;1:捕捉PWM周期时间,精度为1uS
=======================================================================================================================*/
void  ReadFtm2CaptureData(unsigned int Mode)
{
//unsigned short      TempC0V,TempC1V;
//      if((FTM2->STATUS & 0X03)==3)       /*成功发生双沿捕捉*/
//      {
//            TempC0V=(unsigned short)(FTM2->CONTROLS[0].CnV);
//            TempC1V=(unsigned short)((unsigned short)(FTM2->CONTROLS[1].CnV)-(unsigned short)TempC0V);
//            if(Mode)
//            {
//                  SysControlMessage.PwmCycleValue=TempC1V;
//            }else
//            {
//                  if( TempC1V < SysControlMessage.PwmCycleValue)
//                        SysControlMessage.PwmValue=(unsigned int)TempC1V * 1000 / SysControlMessage.PwmCycleValue;
 //                 else  SysControlMessage.PwmValue=0;
 //           };
 //     }else
 //     {
 //           SysControlMessage.PwmValue=0;
 //           SysControlMessage.PwmCycleValue=0;
 //     };
};
/*===================================================发送LPSPI数据==============================================================
输入参数： Channel：LPSPI通道号，取值范围SpiChannel0 ,SpiChannel1 ,SpiChannel2。
            Buff：要发送数据的缓冲区。
            Size：要发送数据的字节数。
            CsUnmber:片选号码，0-3表示：PCS0-PCS3。
            Cpol/Cpha：LPSPI发送数据的相位。
===============================================================================================================================*/
void  TransLPSpi(SPICHANNEL Channel,unsigned char *Buff,unsigned char Size,unsigned char CsNumber,unsigned char Cpol,unsigned char Cpha)
{
unsigned char     *TempPoint;
unsigned    int   *TempTcr;
unsigned char     TempSize,TempNumber;
      if((Size <= 16) && (Size > 0))   /*SPI一次最多传输16个字节,4个缓冲区*/
      {
            switch(Channel)
            {
                  case  SpiChannel0:
                        TempPoint=(unsigned char *)(&LPSPI0->TDR);
                        TempTcr=(unsigned int *)(&LPSPI0->TCR);
                        break;
                  case  SpiChannel1:
                        TempPoint=(unsigned char *)(&LPSPI1->TDR);
                        TempTcr=(unsigned int *)(&LPSPI1->TCR);
                        break;
                  case  SpiChannel2:
                        TempPoint=(unsigned char *)(&LPSPI2->TDR);
                        TempTcr=(unsigned int *)(&LPSPI2->TCR);
                        break;
            };
            TempNumber=0;
            while(TempNumber < Size)
            {
                  memcpy(TempPoint,Buff+TempNumber,4);        /*将数据传送到发送缓冲区*/
                  TempNumber=TempNumber+4;
            };
            TempSize=(Size * 8) - 1;            /*计算SPI发送数据的位数*/
            /*====设置SPI传送命令,CPOL;CPHA;PRESCALE=3;PCS;BYSW=1:字节位置交换;WIDTH=0====*/
            *TempTcr=(Cpol << 31) + (Cpha << 30) + 0X18400000 +  (CsNumber << 24) + TempSize;
      };
};
/*===================================================读LPSPI接收数据===========================================================
输入参数： Channel：LPSPI通道号，取值范围SpiChannel0 ,SpiChannel1 ,SpiChannel2。
            Buff：要读取数据的缓冲区。
            Size：要读取数据的字节数。
==============================================================================================================================*/
void  ReadLPSpi(SPICHANNEL Channel,unsigned char *Buff,unsigned char Size)
{
unsigned char     *TempPoint;
unsigned char     TempNumber;

