zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
            if((Size <= 16) && (Size > 0))   /*SPI一次最多传输16个字节,4个缓冲区*/
      {
            switch(Channel)
            {
                  case  SpiChannel0:
                        TempPoint=(unsigned char *)(&LPSPI0->RDR);
                        break;
                  case  SpiChannel1:
                        TempPoint=(unsigned char *)(&LPSPI1->RDR);
                        break;
                  case  SpiChannel2:
                        TempPoint=(unsigned char *)(&LPSPI2->RDR);
                        break;
            };
            TempNumber=0;
            while(TempNumber < Size)
            {
                  memcpy(Buff + TempNumber,TempPoint,4);
                  TempNumber=TempNumber+4;
            };
      }
};
/*==============================================清空LPSPI接收缓冲区(FIFO)========================================================
输入参数： Channel：LPSPI通道号，取值范围SpiChannel0 ,SpiChannel1 ,SpiChannel2。
  返回值:  接收缓冲区中的最后一个数据.
================================================================================================================================*/
unsigned int  ClearLPSpiReceFIFO(SPICHANNEL Channel)
{
LPSPI_Type  *LPSpiPoint;
unsigned int      TempValue;  /*临时变量*/
      switch(Channel)
      {
            case  SpiChannel0:
                  LPSpiPoint=LPSPI0;
                  break;
            case  SpiChannel1:
                  LPSpiPoint=LPSPI1;
                  break;
            case  SpiChannel2:
                  LPSpiPoint=LPSPI2;
                  break;
      };
      while((LPSpiPoint->RSR & 0X02) == 0)      /*接收缓冲区(FIFO)不空*/
      {
            TempValue=LPSpiPoint->RDR;
      };
      return TempValue;
};
/*===========================================通过DMA方式与外置EEPROM进行SPI通讯==========================================
功能说明: 
      该函数完成SPI通讯,使用DMA方式,一次传输批量数据通过SPI发送给EEPROM.
参数:
      Tran:SPI发送数据缓冲区地址.
      Rece:SPI接收数据缓冲区地址.
      Size:一次传送的数据数量(Byte个数)
=========================================================================================================================*/
void EepromSpiDma(unsigned char *Tran,unsigned char *Rece,int ByteSize)
{
int   TempCount;
int   TempSize;
      if(ByteSize>0)    /*SPI发送的数据必须大于一个字节*/
      {
            if( ByteSize % 4) TempCount=(ByteSize /4) + 1;
            else TempCount=ByteSize /4 ;
            /*================================设置DMA通道12的TCB配置(SPI1 RECE)================================*/
            DMA->TCD[10].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(TempCount);        /*在主循环内共计有1个小循环*/     
            DMA->TCD[10].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(TempCount);        /*在主循环内共计有1个小循环*/
            DMA->TCD[10].NBYTES.MLOFFNO=DMA_TCD_NBYTES_MLOFFNO_NBYTES(4) ;  
            DMA->TCD[10].SADDR=DMA_TCD_SADDR_SADDR(&LPSPI1->RDR);           /*SPI1通道DMA传输源地址(SPI1接收寄存器)*/ 
            DMA->TCD[10].SOFF=0;    /*源地址偏移量*/
            DMA->TCD[10].ATTR=DMA_TCD_ATTR_DSIZE(2) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(2) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,32位数据格式*/
            DMA->TCD[10].SLAST=0;    /*主循环完成后源地址回调*/
            DMA->TCD[10].DADDR=DMA_TCD_DADDR_DADDR(Rece);     /*SPI1通道DMA传输目标地址(SPI1接收缓冲区)*/
            DMA->TCD[10].DOFF=4;    /*目标地址偏移量*/
            DMA->TCD[10].DLASTSGA=DMA_TCD_DLASTSGA_DLASTSGA(-4 * TempCount);     /*主循环完成后目标地址回调*/
            DMA->TCD[10].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(1)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);

            /*================================设置DMA通道11的TCB配置(SPI1 TRAN)================================*/
            DMA->TCD[9].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(TempCount);        /*在主循环内共计有1个小循环*/     
            DMA->TCD[9].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(TempCount);        /*在主循环内共计有1个小循环*/
            DMA->TCD[9].NBYTES.MLOFFNO=DMA_TCD_NBYTES_MLOFFNO_NBYTES(4) ;  
            DMA->TCD[9].SADDR=DMA_TCD_SADDR_SADDR(Tran);       /*SPI1通道DMA传输源地址(SPI1发送)*/ 
            DMA->TCD[9].SOFF=4;          /*源地址偏移量*/
            DMA->TCD[9].ATTR=DMA_TCD_ATTR_DSIZE(2) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(2) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,32位数据格式*/
            DMA->TCD[9].SLAST=DMA_TCD_DLASTSGA_DLASTSGA(-4 * TempCount);         /*主循环完成后源地址回调*/
            DMA->TCD[9].DADDR=DMA_TCD_DADDR_DADDR(&LPSPI1->TDR);       /*SPI1通道DMA传输目标地址(SPI1接收缓冲区)*/
            DMA->TCD[9].DOFF=0;          /*目标地址偏移量*/
            DMA->TCD[9].DLASTSGA=0;      /*主循环完成后目标地址回调*/
            DMA->TCD[9].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(1)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);

            TempSize=(ByteSize * 8) - 1;              /*计算SPI发送数据的位数*/
            LPSPI1->TCR =0X18400000 + TempSize;       /*设置SPI0传送命令,CPOL=0;CPHA=0;PRESCALE=3;PCS=PCS0;BYSW=1:字节位置交换;WIDTH=0*/
            
            DMA->SERQ=DMA_SERQ_SERQ(10);        /*使能SPI1 RECE通道DMA服务*/
            DMA->SERQ=DMA_SERQ_SERQ(9);         /*使能SPI1 TRAN通道DMA服务*/
      };
};
/*=====================================================初始化FTM0的各项配置===============================================
功能说明: 
      该函数完成初始化FTM0的各项配置.
参数:
      无
返回值：
			无
=========================================================================================================================*/
void FTM0_init(void)
{
	/**
	 * FTM0 Clocking:
	 * ==================================================
	 */
	PCC->PCCn[PCC_FTM0_INDEX] &= ~PCC_PCCn_CGC_MASK; 	/* Ensure clk disabled for config 	*/
	//使能FTM0时钟
	PCC->PCCn[PCC_FTM0_INDEX] |= PCC_PCCn_PCS(1)	/* Clock Src=1, 8 MHz SIRCDIV1_CLK */
                              |  PCC_PCCn_CGC_MASK;  	/* Enable clock for FTM regs 		*/

	/*!
	 * FTM0 Initialization:
	 * ===================================================
	 */
	FTM0->MODE |= FTM_MODE_WPDIS_MASK;  /* Write protect to registers disabled (default) 				*/
	FTM0->SC	=		FTM_SC_PWMEN0_MASK	/* Enable PWM channel 0 output	*/
					|FTM_SC_PWMEN1_MASK	/* Enable PWM channel 1 output	*/
					|FTM_SC_PWMEN2_MASK	/* Enable PWM channel 2 output	*/
					|FTM_SC_PWMEN3_MASK	/* Enable PWM channel 3 output	*/
					|FTM_SC_PWMEN4_MASK	/* Enable PWM channel 4 output	*/
					|FTM_SC_PWMEN5_MASK	/* Enable PWM channel 5 output	*/
					|FTM_SC_PWMEN6_MASK	/* Enable PWM channel 6 output									*/
					|FTM_SC_PWMEN7_MASK 	/* Enable PWM channel 7 output									*/
					|FTM_SC_PS(0)
					|FTM_SC_TOIE(0);     	/* TOIE (Timer Overflow Interrupt Ena) = 0 (default) 			*/
										/* CPWMS (Center aligned PWM Select) = 0 (default, up count) 	*/
										/* CLKS (Clock source) = 0 (default, no clock; FTM disabled) 	*/
										/* PS (Prescaler factor) = 1. Prescaler = 1 					*/

