zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
	FTM0->COMBINE = 0x00000000;	/* FTM mode settings used: DECAPENx, MCOMBINEx, COMBINEx=0 */
	FTM0->POL = 0x00000000;    	/* Polarity for all channels is active high (default) 		*/
	FTM0->MOD = 1667 -1 ;     	/* FTM1 counter final value (used for PWM mode) 			*/
								/* FTM1 Period = MOD-CNTIN+0x0001 ~= 62500 ctr clks  		*/
								/* 8MHz /1 = 8000kHz ->  ticks -> 48kHz 					*/
//	FTM0_CH6_PWM_init(70);			
//	FTM0_CH7_PWM_init(30);			
}
/*=====================================================初始化FTM0的各项配置===============================================
功能说明: 
      该函数完成初始化FTM1的各项配置.
参数:
      无
返回值：
			无
=========================================================================================================================*/
void FTM1_init(void)
{
	/**
	 * FTM0 Clocking:
	 * ==================================================
	 */
	PCC->PCCn[PCC_FTM1_INDEX] &= ~PCC_PCCn_CGC_MASK; 	/* Ensure clk disabled for config 	*/
	//使能FTM0时钟
	PCC->PCCn[PCC_FTM1_INDEX] |= PCC_PCCn_PCS(1)	/* Clock Src=1, 8 MHz SIRCDIV1_CLK */
                              |  PCC_PCCn_CGC_MASK;  	/* Enable clock for FTM regs 		*/

	/*!
	 * FTM0 Initialization:
	 * ===================================================
	 */
	FTM1->MODE |= FTM_MODE_WPDIS_MASK;  /* Write protect to registers disabled (default) 				*/
	FTM1->SC	=		FTM_SC_PWMEN0_MASK	/* Enable PWM channel 0 output	*/
					|FTM_SC_PWMEN1_MASK	/* Enable PWM channel 1 output	*/
					|FTM_SC_PWMEN2_MASK	/* Enable PWM channel 2 output	*/
					|FTM_SC_PWMEN3_MASK	/* Enable PWM channel 3 output	*/
					|FTM_SC_PWMEN4_MASK	/* Enable PWM channel 4 output	*/
					|FTM_SC_PWMEN5_MASK	/* Enable PWM channel 5 output	*/
					|FTM_SC_PWMEN6_MASK	/* Enable PWM channel 6 output	*/
					|FTM_SC_PWMEN7_MASK 	/* Enable PWM channel 7 output	*/
					|FTM_SC_PS(0)
					|FTM_SC_TOIE(0);     	/* TOIE (Timer Overflow Interrupt Ena) = 0 (default) 			*/
										/* CPWMS (Center aligned PWM Select) = 0 (default, up count) 	*/
										/* CLKS (Clock source) = 0 (default, no clock; FTM disabled) 	*/
										/* PS (Prescaler factor) = 1. Prescaler = 1 					*/

	FTM1->COMBINE = 0x00000000;	/* FTM mode settings used: DECAPENx, MCOMBINEx, COMBINEx=0 */
	FTM1->POL = 0x00000000;    	/* Polarity for all channels is active high (default) 		*/
	FTM1->MOD = 1667 -1 ;     	/* FTM1 counter final value (used for PWM mode) 			*/
								/* FTM1 Period = MOD-CNTIN+0x0001 ~= 62500 ctr clks  		*/
								/* 8MHz /1 = 8000kHz ->  ticks -> 48kHz 					*/
//	FTM1_CH6_PWM_init(70);			
//	FTM1_CH7_PWM_init(30);			
}
/*======================================================================FTM模块开始工作===================================================
Module：模块号，0，1，2
=======================================================================================================================================*/
void StartFtmCounter (unsigned int	Module)
{
	switch(Module)
	{
		case 	0:
			FTM0->SC |= FTM_SC_CLKS(1);
			break;
		case	1:
			FTM1->SC |= FTM_SC_CLKS(1);
			break;
		case 	2:
			FTM2->SC |= FTM_SC_CLKS(1);
			break;
	};
//	FTM0->SC |= FTM_SC_CLKS(3);
	/* Start FTM0 counter with clk source = external clock (SOSCDIV1_CLK)*/
}

/*===============================================================初始化FTM0 PWM配置======================================================
功能说明: 
      该函数完成初始化FTM0的各项配置,主要为占空比.
参数:
	Channel:通道号：0，1，2，3，4，5，6，7
      duty:占空比（0-100）
返回值：
			无
=======================================================================================================================================*/
void FTM0_PWM_init(unsigned int Channel,unsigned int duty)
{
	switch(Channel)
	{
		case	0:
			FTM0->CONTROLS[0].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[0].CnV =  (FTM0->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	1:
			FTM0->CONTROLS[1].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[1].CnV =  (FTM0->MOD+1)*duty/100;;			/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	2:
			FTM0->CONTROLS[2].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[2].CnV =  (FTM0->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	3:
			FTM0->CONTROLS[3].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[3].CnV =  (FTM0->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	4:
			FTM0->CONTROLS[4].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[4].CnV =  (FTM0->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	5:
			FTM0->CONTROLS[5].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses ；EN_DMA	*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[5].CnV =  (FTM0->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	6:
			FTM0->CONTROLS[6].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[6].CnV =  (FTM0->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	7:
			FTM0->CONTROLS[7].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK|0X41;  /* FTM0 ch6: edge-aligned PWM, low true pulses En_DMA*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM0->CONTROLS[7].CnV =  (FTM0->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
	};
}

/*===============================================================初始化FTM0 PWM配置======================================================
功能说明: 
      该函数完成初始化FTM1的各项配置,主要为占空比.
参数:
	Channel:通道号：0，1，2，3，4，5，6，7
      duty:占空比（0-100）
返回值：
			无
=======================================================================================================================================*/
void FTM1_PWM_init(unsigned int Channel,unsigned int duty)
{
	/**
	 * FTM0, Channel 6 in PWM Mode:
	 * ==================================================
	 */
	switch(Channel)
	{
		case	0:
			FTM1->CONTROLS[0].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[0].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	1:
			FTM1->CONTROLS[1].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK|0X41;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 	，Enable DMA*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[1].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	2:
			FTM1->CONTROLS[2].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[2].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	3:
			FTM1->CONTROLS[3].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[3].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	4:
			FTM1->CONTROLS[4].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[4].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	5:
			FTM1->CONTROLS[5].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[5].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	6:
			FTM1->CONTROLS[6].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[6].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
		case	7:
			FTM1->CONTROLS[7].CnSC = FTM_CnSC_MSB_MASK | FTM_CnSC_ELSB_MASK ;  	/* FTM0 ch6: edge-aligned PWM, low true pulses 		*/
															/* CHIE (Chan Interrupt Ena) = 0 (default) 			*/
															/* MSB:MSA (chan Mode Select)=0b10, Edge Align PWM		*/																																			/* ELSB:ELSA (chan Edge/Level Select)=0b10, low true 	*/
			FTM1->CONTROLS[7].CnV =  (FTM1->MOD+1)*duty/100;				/* 0~100 FTM0 ch1 compare value (0~100%:duty cycle) */
		break;
	};
}

void Fmt0Dma0Tran(unsigned char *Tran,unsigned int DataSize)				/*FMT0，DMA0数据传输*/
{
//int   TempSize;
      if(DataSize>0)    /*SPI发送的数据必须大于一个字节*/
      {

            /*================================设置DMA通道0的TCB配置================================*/
            DMA->TCD[0].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(DataSize);        /*在主循环内共计有DataSize个小循环*/     
            DMA->TCD[0].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(DataSize);        /*在主循环内共计有DataSize个小循环*/
            DMA->TCD[0].NBYTES.MLOFFNO=DMA_TCD_NBYTES_MLOFFNO_NBYTES(2) ;  		 /*DMA传输一次、2个字节数据*/
            DMA->TCD[0].SADDR=DMA_TCD_SADDR_SADDR(Tran);       
            DMA->TCD[0].SOFF=2;          /*源地址偏移量*/
            DMA->TCD[0].ATTR=DMA_TCD_ATTR_DSIZE(1) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(1) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,16位数据格式*/
            DMA->TCD[0].SLAST=DMA_TCD_DLASTSGA_DLASTSGA((-2 * (int)DataSize));         /*主循环完成后源地址回调*/
            DMA->TCD[0].DADDR=DMA_TCD_DADDR_DADDR(&(FTM0->CONTROLS[7].CnV));       /*SPI0通道DMA传输目标地址(FTM0-CH7接收缓冲区)*/
            DMA->TCD[0].DOFF=0;          /*目标地址偏移量*/
            DMA->TCD[0].DLASTSGA=0;      /*主循环完成后目标地址回调*/
            DMA->TCD[0].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);
//            DMA->TCD[0].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(1)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);

            
            DMA->SERQ=DMA_SERQ_SERQ(0);        /*使能SPI0 TRAN通道DMA服务*/
		
