zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
      };
};

void Fmt0Dma1Tran(unsigned char *Tran,unsigned int DataSize)				/*FMT0，DMA1数据传输*/
{
//int   TempSize;
      if(DataSize>0)    /*SPI发送的数据必须大于一个字节*/
      {
//            if( ByteSize % 4) TempCount=(ByteSize /4) + 1;
//            TempCount=DataSize ;

            /*================================设置DMA通道0的TCB配置================================*/
            DMA->TCD[1].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(DataSize);        /*在主循环内共计有DataSize个小循环*/     
            DMA->TCD[1].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(DataSize);        /*在主循环内共计有DataSize个小循环*/
            DMA->TCD[1].NBYTES.MLOFFNO=DMA_TCD_NBYTES_MLOFFNO_NBYTES(2) ;  		 /*DMA传输一次、2个字节数据*/
            DMA->TCD[1].SADDR=DMA_TCD_SADDR_SADDR(Tran);       
            DMA->TCD[1].SOFF=2;          /*源地址偏移量*/
            DMA->TCD[1].ATTR=DMA_TCD_ATTR_DSIZE(1) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(1) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,16位数据格式*/
            DMA->TCD[1].SLAST=DMA_TCD_DLASTSGA_DLASTSGA((-2 * (int)DataSize));         /*主循环完成后源地址回调*/
            DMA->TCD[1].DADDR=DMA_TCD_DADDR_DADDR(&(FTM1->CONTROLS[1].CnV));       /*SPI0通道DMA传输目标地址(FTM0-CH5接收缓冲区)*/
            DMA->TCD[1].DOFF=0;          /*目标地址偏移量*/
            DMA->TCD[1].DLASTSGA=0;      /*主循环完成后目标地址回调*/
            DMA->TCD[1].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);

            
            DMA->SERQ=DMA_SERQ_SERQ(1);        /*使能SPI0 TRAN通道DMA服务*/
		
      };
};
/*===================================================================司机座椅声音播放==============================================================================
LeftSound：左声道数据缓冲区
RightSound：右声道数据缓冲区
DataSize：声音缓冲区长度
==================================================================================================================================================================*/
void	DriverMusicOutput(unsigned char *LeftSound,unsigned	char *RightSound,unsigned int DataSize)	
{
	if(DataSize>0)    /*SPI发送的数据必须大于一个字节*/
      {
		/*=============================================左声道DMA设置=========================================*/
            DMA->TCD[0].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(DataSize);        /*在主循环内共计有DataSize个小循环*/     
            DMA->TCD[0].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(DataSize);        /*在主循环内共计有DataSize个小循环*/
            DMA->TCD[0].NBYTES.MLOFFNO=DMA_TCD_NBYTES_MLOFFNO_NBYTES(2) ;  		 /*DMA传输一次、2个字节数据*/
            DMA->TCD[0].SADDR=DMA_TCD_SADDR_SADDR(LeftSound);       
            DMA->TCD[0].SOFF=2;          /*源地址偏移量*/
            DMA->TCD[0].ATTR=DMA_TCD_ATTR_DSIZE(1) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(1) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,16位数据格式*/
            DMA->TCD[0].SLAST=DMA_TCD_DLASTSGA_DLASTSGA((-2 * (int)DataSize));         /*主循环完成后源地址回调*/
            DMA->TCD[0].DADDR=DMA_TCD_DADDR_DADDR(&(FTM0->CONTROLS[7].CnV));       /*SPI0通道DMA传输目标地址(FTM0-CH7接收缓冲区)*/
            DMA->TCD[0].DOFF=0;          /*目标地址偏移量*/
            DMA->TCD[0].DLASTSGA=0;      /*主循环完成后目标地址回调*/
            DMA->TCD[0].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);
		/*=============================================右声道DMA设置=========================================*/
            DMA->TCD[1].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(DataSize);        /*在主循环内共计有DataSize个小循环*/     
            DMA->TCD[1].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(DataSize);        /*在主循环内共计有DataSize个小循环*/
            DMA->TCD[1].NBYTES.MLOFFNO=DMA_TCD_NBYTES_MLOFFNO_NBYTES(2) ;  		 /*DMA传输一次、2个字节数据*/
            DMA->TCD[1].SADDR=DMA_TCD_SADDR_SADDR(RightSound);       
            DMA->TCD[1].SOFF=2;          /*源地址偏移量*/
            DMA->TCD[1].ATTR=DMA_TCD_ATTR_DSIZE(1) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(1) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,16位数据格式*/
            DMA->TCD[1].SLAST=DMA_TCD_DLASTSGA_DLASTSGA((-2 * (int)DataSize));         /*主循环完成后源地址回调*/
            DMA->TCD[1].DADDR=DMA_TCD_DADDR_DADDR(&(FTM1->CONTROLS[1].CnV));       /*SPI0通道DMA传输目标地址(FTM0-CH5接收缓冲区)*/
            DMA->TCD[1].DOFF=0;          /*目标地址偏移量*/
            DMA->TCD[1].DLASTSGA=0;      /*主循环完成后目标地址回调*/
            DMA->TCD[1].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);
		/*================================================使能DMA=========================================*/
		DMA->SERQ=DMA_SERQ_SERQ(0);        /*使能SPI0 TRAN通道DMA服务*/
		DMA->SERQ=DMA_SERQ_SERQ(1);        /*使能SPI0 TRAN通道DMA服务*/
	};
};

/*=============================================================初始化FLEX_IO -->IIS========================================================
IIS工作条件（进输入）：
	FLEXIO_D3：IIS数据输入PIN。
	FLEXIO_D4：IIS数据同步（SYNC。）PIN，左右声道识别
	FLEXIO_D5：IIS数据移位时钟输入PIN。
==========================================================================================================================================*/
void	FlexIOInit(void)
{
	/*===================================使能FLEX_IO时钟=========================================*/	
	PCC->PCCn[PCC_FlexIO_INDEX] = 0;                /* Disable clocks to modify PCS ( default) */
	PCC->PCCn[PCC_FlexIO_INDEX] = 0xC6000000;       /* Enable PCS=SPLL_DIV2 (40 MHz func'l clock) */
/*==============================================================FLEX_IO配置1===========================================================*/		
//	FLEXIO->SHIFTCFG[0] = FLEXIO_SHIFTCFG_SSTART(0)				/*Start位无效，接收器在第一个移位加载数据*/
//                               | FLEXIO_SHIFTCFG_SSTOP(0)
//                               | FLEXIO_SHIFTCFG_INSRC(0);			/*PIN*/
//	FLEXIO->SHIFTCTL[0] = FLEXIO_SHIFTCTL_SMOD(1)				/*Receive接收模式*/
//                                | FLEXIO_SHIFTCTL_PINPOL(0)			/*不适用与接收模式*/
//					  | FLEXIO_SHIFTCTL_PINSEL(3)			/*FLEX_IO:D3，数据采集端口*/
//                                | FLEXIO_SHIFTCTL_PINCFG(0)			/*不适用与接收模式*/
//                                | FLEXIO_SHIFTCTL_TIMPOL(1)			/*下降沿数据移位*/
//                                | FLEXIO_SHIFTCTL_TIMSEL(0);		/*选择0号定时器配合移位*/
	/*==================================================Configure SCK timer =========================================================*/
//	FLEXIO->TIMCMP[0] = 63;								/*（FLEXIO->TIMCMP[0]+1）/2：总的数据位数，H/L：左右声道*/
//	FLEXIO->TIMCFG[0] = FLEXIO_TIMCFG_TSTART(0)				/*定时器没有起始位*/
//                            | FLEXIO_TIMCFG_TSTOP(0)				/*定时器没有停止位*/
//                            | FLEXIO_TIMCFG_TIMENA(0)				/*定时器时钟有效*/
//                            | FLEXIO_TIMCFG_TIMDIS(0)				/*定时器时钟有效*/
//                            | FLEXIO_TIMCFG_TIMRST(6)				/*定时器在外部触发上升沿复位*/
//                           | FLEXIO_TIMCFG_TIMDEC(2)				/*定时器递减计数来自PIN（双沿），移位寄存器等效*/
//                            | FLEXIO_TIMCFG_TIMOUT(0);			/*定时器无输出*/
//	FLEXIO->TIMCTL[0] = FLEXIO_TIMCTL_TIMOD(3)				/*16位定时器模式*/
//			          | FLEXIO_TIMCTL_PINSEL(5)				/*定时器递减信号输入，FLEX_IO:D5*/
//                            | FLEXIO_TIMCTL_PINPOL(0)				/*接收模式不关注*/
//                            | FLEXIO_TIMCTL_PINCFG(0)				/*定时器没有输出*/
//                            | FLEXIO_TIMCTL_TRGSRC(1)				/*定时器内部触发*/
//                            | FLEXIO_TIMCTL_TRGPOL(0)				/*定时器无触发输出*/
//                            | FLEXIO_TIMCTL_TRGSEL(8);			/*定时器触发有PIN针FLEX_IO:D4*/
/*==============================================================FLEX_IO配置2(OK)===========================================================*/	
	FLEXIO->SHIFTCFG[1] = 0X0;
	FLEXIO->SHIFTCTL[1] = 0X01030602;		/*D6输出IIS,Timer1,上升沿移位输出*/
	
	FLEXIO->SHIFTCFG[0] = 0X0;
	FLEXIO->SHIFTCTL[0] = 0X00800301;		/*D3输入IIS,timer0，下降沿移位输入*/
//	FLEXIO->SHIFTCTL[0] = 0X00100301;		/*D3输入IIS,timer0，上升沿移位输入*/

