zjtlfc/controller/two_channel/RTX5_Blinky/S32K144_API.c
	/* Configure SCK timer */
	FLEXIO->TIMCMP[0] = 63;								/*（FLEXIO->TIMCMP[0]+1）/2：总的数据位数，H/L：左右声道*/
	FLEXIO->TIMCFG[0] = 0X00202500;
	FLEXIO->TIMCTL[0] = 0X0B400583;		/*IIS时钟信号D5,定时器2输出触发*/
	
	FLEXIO->TIMCMP[1] = 63;								/*（FLEXIO->TIMCMP[0]+1）/2：总的数据位数，H/L：左右声道*/
	FLEXIO->TIMCFG[1] = 0X00202500;
	FLEXIO->TIMCTL[1] = 0X03400583;		/*IIS时钟信号D5*/

	FLEXIO->TIMCMP[2] = 0;								/*（FLEXIO->TIMCMP[0]+1）/2：总的数据位数，H/L：左右声道*/
	FLEXIO->TIMCFG[2] = 0X00206400;
	FLEXIO->TIMCTL[2] = 0x0A400483;		/*IIS时钟信号D5*/
/*==============================================================FLEX_IO配置3===========================================================*/		
//	FLEXIO->SHIFTCFG[0] = FLEXIO_SHIFTCFG_SSTART(0)				/*Start位无效，接收器在第一个移位加载数据*/
//					| FLEXIO_SHIFTCFG_SSTOP(0)
//					| FLEXIO_SHIFTCFG_INSRC(0);			/*PIN*/
//	FLEXIO->SHIFTCTL[0] = FLEXIO_SHIFTCTL_SMOD(1)				/*Receive接收模式*/
//					| FLEXIO_SHIFTCTL_PINPOL(0)			/*不适用与接收模式*/
//					| FLEXIO_SHIFTCTL_PINSEL(3)			/*FLEX_IO:D3，数据采集端口*/
//					| FLEXIO_SHIFTCTL_PINCFG(0)			/*接收模式,输出禁止*/
//					| FLEXIO_SHIFTCTL_TIMPOL(1)			/*下降沿数据移位*/
//					| FLEXIO_SHIFTCTL_TIMSEL(0);		/*选择0号定时器配合移位*/
//	/*==================================================Configure SCK timer =========================================================*/
//	FLEXIO->TIMCMP[0] = 33;								/*（FLEXIO->TIMCMP[0]+1）/2：总的数据位数，H/L：左右声道*/
//	FLEXIO->TIMCFG[0] = FLEXIO_TIMCFG_TSTART(0)				/*定时器没有起始位*/
//					| FLEXIO_TIMCFG_TSTOP(0)			/*定时器没有停止位*/
//					| FLEXIO_TIMCFG_TIMENA(6)			/*定时器使能并移位条件：触发信号上升沿D4：SYNC*/
//					| FLEXIO_TIMCFG_TIMENA(5)			/*定时器使能并移位条件：触发信号高电平D4：SYNC；移位信号上升沿*/
//					| FLEXIO_TIMCFG_TIMDIS(2)			/*定时器禁止条件：定时器比较完成后*/
//					| FLEXIO_TIMCFG_TIMRST(0)			/*定时器复位条件：永远不复位*/
//					| FLEXIO_TIMCFG_TIMDEC(2)			/*定时器递减计数来自PIN：D3（双沿），移位寄存器等效*/
//					| FLEXIO_TIMCFG_TIMOUT(0);			/*定时器初始化输出1：不受定时器复位影响*/
//	FLEXIO->TIMCTL[0] = FLEXIO_TIMCTL_TIMOD(3)				/*16位定时器模式*/
//					| FLEXIO_TIMCTL_PINPOL(0)			/*接收模式不关注*/
//					| FLEXIO_TIMCTL_PINSEL(5)			/*定时器递减信号输入，FLEX_IO:D5*/
//					| FLEXIO_TIMCTL_PINCFG(0)			/*定时器为输入模式，输出禁止*/
//					| FLEXIO_TIMCTL_TRGSRC(1)			/*定时器内部触发*/
//					| FLEXIO_TIMCTL_TRGPOL(0)			/*定时器无触发输出*/
//					| FLEXIO_TIMCTL_TRGSEL(8);			/*定时器触发有PIN针FLEX_IO:D4*/
/*=================================================================使能DMA=============================================================*/
	FLEXIO->SHIFTSIEN=0X01;				/*移位寄存器0 中断使能*/
	FLEXIO->SHIFTSDEN=0X01;				/*移位寄存器0 DMA使能*/
	FLEXIO->CTRL=1;					/*使能FLEX_IO模块使能*/
};

/*====================================================================================================================================*/
void FlexioDmaRece(unsigned char *ReceBuff,int DataSize)				/*Flex_IO，DMA12数据传输*/
{
      if(DataSize>0)    /*SPI发送的数据必须大于一个字节*/
      {

            /*================================设置DMA通道0的TCB配置================================*/
            DMA->TCD[12].BITER.ELINKNO=DMA_TCD_BITER_ELINKNO_BITER(DataSize);        /*在主循环内共计有1个小循环*/     
            DMA->TCD[12].CITER.ELINKNO=DMA_TCD_CITER_ELINKNO_CITER(DataSize);        /*在主循环内共计有1个小循环*/
            DMA->TCD[12].NBYTES.MLOFFNO=DMA_TCD_NBYTES_MLOFFNO_NBYTES(4) ;  		 /*DMA传输一次、4个字节数据*/
            DMA->TCD[12].SADDR=DMA_TCD_SADDR_SADDR(&FLEXIO->SHIFTBUFBIS[0]);       
            DMA->TCD[12].SOFF=0;          /*源地址偏移量*/
            DMA->TCD[12].ATTR=DMA_TCD_ATTR_DSIZE(2) | DMA_TCD_ATTR_DMOD(0) |DMA_TCD_ATTR_SSIZE(2) | DMA_TCD_ATTR_SMOD(0);     /*源/目的地址模操作,16位数据格式*/
            DMA->TCD[12].SLAST=0;         /*主循环完成后源地址回调*/
            DMA->TCD[12].DADDR=DMA_TCD_DADDR_DADDR(ReceBuff);       /**/
            DMA->TCD[12].DOFF=4;          /*目标地址偏移量*/
            DMA->TCD[12].DLASTSGA=DMA_TCD_DLASTSGA_DLASTSGA(-4*DataSize);     /*主循环完成后目标地址回调*/
            DMA->TCD[12].CSR=DMA_TCD_CSR_START(0) |DMA_TCD_CSR_INTMAJOR(0)|DMA_TCD_CSR_INTHALF(0) | DMA_TCD_CSR_DREQ(0)|DMA_TCD_CSR_ESG(0) |DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_MAJORELINK(0)|DMA_TCD_CSR_BWC(0) | DMA_TCD_CSR_DONE(0);
		DMA->SERQ=DMA_SERQ_SERQ(12);        /*使能FLEX_IO通道DMA服务*/
		
      };
};
/*==========================================================================================================================*/
unsigned	int	GetIisDmaPosition(unsigned int TotalBufferSize)		/*返回DMA接收IIS数据在缓冲区中的位置*/
{
	return TotalBufferSize-DMA->TCD[12].CITER.ELINKNO;
};
/*==========================================================================================================================*/
void	DisableDma(unsigned int Channel)				/*关闭相应的DMA通道*/
{
	if(Channel <= 15)
		DMA->CERQ=DMA_CERQ_CERQ(Channel);
};
/*==========================================================================================================================*/
unsigned	int	GetSoundDrvPosition(unsigned int TotalBufferSize)		/*返回DMA声音驱动数据在缓冲区中的位置*/	
{
	return TotalBufferSize-DMA->TCD[0].CITER.ELINKNO;
};
	



